[{"text": "  The Company hereby appoints the Warrant Agent to act as agent for the Company for purposes of the administration of the Warrants in accordance with the instructions set forth in this Agreement, and the Warrant Agent hereby accepts such appointment.", "section_full_title": "SECTION 1.Appointment of Warrant Agent.", "document_id": "103uLzqu45vthv8iYk5jJu.", "section_title": "Appointment of Warrant Agent."}, {"text": "  The certificates including the global warrants certificates evidencing the Warrants (the Warrant Certificates) to be delivered pursuant to this Agreement shall be in registered form only and shall be substantially in the form set forth in Exhibit A attached hereto.", "section_full_title": "SECTION 2.Warrant Certificates.", "document_id": "103uLzqu45vthv8iYk5jJu.", "section_title": "Warrant Certificates."}, {"text": "  Warrant Certificates shall be signed on behalf of the Company by its Chairman of the Board or its President or Chief Executive Officer or a Vice President and by its Secretary or an Assistant Secretary. Each such signature upon the Warrant Certificates may be in the form of a facsimile signature of the present or any future Chairman of the Board, President, Chief Executive Officer, Vice President, Secretary or Assistant Secretary and may be imprinted or otherwise reproduced on the Warrant Certificates and for that purpose the Company may adopt and use the facsimile signature of any person who shall have been Chairman of the Board, President, Chief Executive Officer, Vice President, Secretary or Assistant Secretary, notwithstanding the fact that at the time the Warrant Certificates shall be countersigned and delivered or disposed of he or she shall have ceased to hold such office. In case any officer of the Company who shall have signed any of the Warrant Certificates shall cease to be such officer before the Warrant Certificates so signed shall have been countersigned by the Warrant Agent, or disposed of by the Company, such Warrant Certificates nevertheless may be countersigned and delivered or disposed of as though such person had not ceased to be such officer of the Company; and any Warrant Certificate may be signed on behalf of the Company by any person who, at the actual date of the execution of such Warrant Certificate, shall be a proper officer of the Company to sign such Warrant Certificate, although at the date of the execution of this Warrant Agreement any such person was not such officer. Warrant Certificates shall be dated the date of countersignature by the Warrant Agent.", "section_full_title": "SECTION 3.Execution of Warrant Certificates.", "document_id": "103uLzqu45vthv8iYk5jJu.", "section_title": "Execution of Warrant Certificates."}, {"text": "  Warrant Certificates shall be countersigned by the Warrant Agent and shall not be valid for any purpose unless so countersigned. The Warrant Agent shall, upon the written instructions of the Chairman of the Board, the President or Chief Executive Officer, a Vice President, the Treasurer or the Chief Financial Officer of the Company, countersign, issue and deliver Warrants as provided in this Agreement. The Company and the Warrant Agent may deem and treat the registered holder(s) of the Warrant Certificates as the absolute owner(s) thereof (notwithstanding any notation of ownership or other writing thereon made by anyone), for all purposes, and neither the Company nor the Warrant Agent shall be affected by any notice to the contrary. 2", "section_full_title": "SECTION 4.Registration and Countersignature.", "document_id": "103uLzqu45vthv8iYk5jJu.", "section_title": "Registration and Countersignature."}, {"text": "  The Company will provide the Warrant Agent with Warrant certificate issuance instructions after the close of the IPO. At such time, the Warrant Agent will keep or cause to be kept, books for registration and transfer of the Warrant Certificate(s) including any global warrant certificate issued hereunder. Such books shall show the name(s) and address(es) of any holder of the Warrants, the number of China Hydroelectric Warrants on the fact of the Warrant and the date thereon. The Warrant Agent shall from time to time, subject to the limitations of this Section 5, register the transfer of any outstanding Warrant Certificates upon the records to be maintained by it for that purpose, upon surrender thereof duly endorsed or accompanied (if so required by the Warrant Agent) by a written instrument or instruments of transfer in form satisfactory to the Warrant Agent, including a Medallion guarantee duly executed by the registered holder or holders thereof or by the duly appointed legal representative thereof or by a duly authorized attorney. Upon any such registration of transfer, a new Warrant Certificate shall be issued to the transferee(s) and the surrendered Warrant Certificate shall be cancelled by the Warrant Agent. Cancelled Warrant Certificates shall thereafter be disposed of by the Warrant Agent in its customary manner. Each Warrant shall initially be issued together with one ADS. The ADS and the accompanying Warrant shall be separately transferable immediately upon the consummation of the IPO. Subject to the terms of this Agreement, Warrant Certificates may be exchanged at the option of the holder(s) thereof, when surrendered to the Warrant Agent at its principal corporate trust office, which is currently located at the address listed in Section 17 hereof, for another Warrant Certificate or other Warrant Certificates of like tenor and representing in the aggregate a like number of Warrants. Any holder desiring to exchange a Warrant Certificate shall deliver a written request to the Warrant Agent, and shall surrender, duly endorsed or accompanied (if so required by the Warrant Agent) by a written instrument or instruments of transfer in form satisfactory to the Warrant Agent, the Warrant Certificate or Certificates to be so exchanged. Warrant Certificates surrendered for exchange shall be cancelled by the Warrant Agent. Such cancelled Warrant Certificates shall then be disposed of by such Warrant Agent in its customary manner. The Warrant Agent is hereby authorized to countersign, in accordance with the provisions of Section 4 hereof and of this Section 5, the new Warrant Certificates required pursuant to the provisions of this Section 5. Warrant Agent shall follow its regular procedures to attempt to reconcile any discrepancies between the number of Warrants that any exercise instructions may indicate and the number that the Warrant Agent indicates such holder owns. In any instance where Warrant Agent cannot reconcile such discrepancies by following such procedures, Warrant Agent will consult with the Company for instructions as to the number of certificated Warrants, if any, Warrant Agent is authorized to accept for exercise. In the absence of such instructions, Warrant Agent is authorized not to accept any such certificated Warrants for exercise and will return to the Warrant holder (at Warrant Agent's option by either first class mail under a blanket surety bond or insurance protecting Warrant Agent and the Company from losses or liabilities arising out of the non-receipt or non-delivery of such Warrants or by registered mail insured separately for the value of such Warrants) to such Warrant holder's address as set forth in the Warrants surrendered in connection with an exercise.", "section_full_title": "SECTION 5.Transfers and Exchanges.", "document_id": "103uLzqu45vthv8iYk5jJu.", "section_title": "Transfers and Exchanges."}, {"text": "  (a)Exercise Price and Exercise Period The initial exercise price at which Warrant Shares shall be purchasable upon the exercise of Warrants (the Exercise Price) shall be $15 for every three Ordinary Shares, and each Warrant shall be initially exercisable to purchase three Ordinary Shares. For avoidance of doubt, no Warrant shall be exercisable for less than three Ordinary Shares. Subject to the terms of this Agreement (including without limitation Section 6(d) below), each Warrant holder shall have the right, which may be exercised commencing at the opening of business on the first day of the applicable Warrant Exercise Period set forth below and until 5:00 p.m., New York City time, on the last day of such Warrant Exercise Period, to receive from the Company the number of fully paid and nonassessable Warrant Shares which the holder may at the time be entitled to receive upon the proper exercise of such Warrant in accordance with Section 6(c) of this Agreement. No adjustments as to dividends will be made upon exercise of the Warrants. The Warrant Exercise Period shall commence (subject to Section 6(d) below) immediately upon the consummation of the IPO and shall end on the earlier of (x) the fourth anniversary of the date of the final prospectus relating to the IPO and (y) the Business Day preceding the date on which such Warrants are redeemed pursuant to Section 6(b) below. Business Day shall mean any day on which the New York Stock Exchange is open for trading and which is not a Saturday, a Sunday or any other day on which banks in the City of New York, New York, are authorized or required by law to close. Each Warrant not exercised or redeemed prior to 5:00 p.m., New York City time, on the last day of the Warrant Exercise Period shall become void and all rights thereunder and all rights in respect thereof under this Agreement shall cease as of such time. (b)Redemption of Warrants 3 The Company may call the Warrants for redemption, in whole and not in part, at a price of $0.01 per Warrant, upon not less than 30 days prior written notice of redemption to each Warrant holder, at any time after such Warrants have become exercisable pursuant to Section 6(a) above, if, and only if, (A) the Closing Price has equaled or exceeded $23.00 per ADS for any 20 trading days within a 30-trading-day period ending on the third Business Day prior to the notice of redemption to Warrant holders and (B) at all times between the date of such notice of redemption and the redemption date a registration statement filed pursuant to the Securities Act is in effect covering the Warrant Shares issuable upon exercise of the Warrants and a current prospectus relating to those Warrant Shares is available. The Company shall send to the Warrant holders and file with the Warrant Agent a notice of such redemption. Such notice shall be mailed to the registered holders at their addresses as they appear in the warrant register. The Closing Price of the ADSs on any date of determination means: (A) the last reported sale price for the regular trading session (without considering after hours or other trading outside regular trading session hours) of the ADSs on the New York Stock Exchange on that date, (B) if the ADSs are not listed for trading on the New York Stock Exchange on that date, the last reported sale price reported in the composite transactions for the principal United States securities exchange on which the ADSs are so listed, (C) if the ADSs are not so reported, the last quoted bid price for the ADSs in the over-the-counter market as reported by the OTC Bulletin Board, the National Quotation Bureau or similar organization, or (D) if the ADSs are not so quoted, the average of the mid-point of the last bid and ask prices for the ADSs from at least three nationally recognized investment banking firms that the Company selects for this purpose. (c)Exercise Procedure A Warrant may be exercised upon surrender to the Company at the principal stock transfer office of the Warrant Agent, which is currently located at the address listed in Section 17 hereof, of the Warrant Certificate or Certificates to be exercised with the form of election to purchase on the reverse thereof duly filled in and signed and such other documentation as the Warrant Agent may reasonably request, and upon payment to the Warrant Agent for the account of the Company of the Exercise Price (adjusted as herein provided if applicable) for the number of Warrant Shares in respect of which such Warrants are then exercised. Payment of the aggregate Exercise Price shall be made by certified check or wire transfer in lawful money of the United States of America. In no event will any Warrants be settled on a net cash basis. Subject to the provisions of Section 7 hereof, upon such surrender of Warrants and payment of the Exercise Price the Company shall issue and cause to be delivered with all reasonable dispatch to and in such name or names as the Warrant holder may designate, a certificate or certificates for the number of full Warrant Shares issuable upon the exercise of such Warrants. Such certificate or certificates shall be deemed to have been issued and any person so designated to be named therein shall be deemed to have become a holder of record of such Warrant Shares as of the date of the surrender of such Warrants and payment of the Exercise Price. The Warrants shall be exercisable, at the election of the holders thereof, either in full or from time to time in part and, in the event that a certificate evidencing Warrants is exercised in respect of fewer than all of the Warrant Shares issuable on such exercise at any time prior to the date of expiration of the Warrants, a new certificate evidencing the remaining Warrant or Warrants will be issued, and the Warrant Agent is hereby irrevocably authorized to countersign and to deliver the required new Warrant Certificate or Certificates pursuant to the provisions of Section 4 hereof and of this Section 6, and the Company, whenever required by the Warrant Agent, shall supply the Warrant Agent with Warrant Certificates duly executed on behalf of the Company for such purpose. The Warrant Agent may assume that any Warrant presented for exercise is permitted to be so exercised under applicable law and shall have no liability for acting in reliance on such assumption. All Warrant Certificates surrendered upon exercise of Warrants shall be canceled by the Warrant Agent. Such canceled Warrant Certificates shall then be disposed of by the Warrant Agent in its customary manner. The Warrant Agent shall account promptly to the Company with respect to Warrants exercised and concurrently pay to the Company all cleared monies received by the Warrant Agent for the purchase of the Warrant Shares through the exercise of such Warrants. The Warrant Agent shall keep copies of this Agreement and any notices given or received hereunder available for inspection by the holders with reasonable prior written notice during normal business hours at its office. The Company shall supply the Warrant Agent from time to time with such numbers of copies of this Agreement as the Warrant Agent may request. 4 (d)Registration Requirement Notwithstanding anything else in this Section 6, no Warrant may be exercised unless at the time of exercise (A) a registration statement covering the Warrant Shares to be issued upon exercise of the Warrants is effective under the Securities Act and (B) a prospectus thereunder relating to the Warrant Shares is current. The Company shall use its best efforts to have a registration statement in effect covering Warrant Shares issuable upon exercise of the Warrants from the date the Warrants become exercisable and to maintain a current prospectus relating to those Warrant Shares until the Warrants expire or are redeemed. In no event shall the Company be required to issue unregistered shares upon the exercise of any Warrant or settle Warrants on a net cash basis.", "section_full_title": "SECTION 6.Terms of Warrants", "document_id": "103uLzqu45vthv8iYk5jJu.", "section_title": "Terms of Warrants"}, {"text": "  The Company will pay all documentary stamp taxes attributable to the initial issuance of Warrant Shares upon the exercise of Warrants; provided, however, that the Company shall not be required to pay any tax or taxes which may be payable in respect of any transfer involved in the issue of any Warrant Certificates or any certificates for Warrant Shares in a name other than that of the registered holder of a Warrant Certificate surrendered upon the exercise of a Warrant, and the Company shall not be required to issue or deliver such Warrant Certificates unless or until the person or persons requesting the issuance thereof shall have paid to the Company the amount of such tax or shall have established to the satisfaction of the Company that such tax has been paid.", "section_full_title": "SECTION 7.Payment of Taxes.", "document_id": "103uLzqu45vthv8iYk5jJu.", "section_title": "Payment of Taxes."}, {"text": "  In case any of the Warrant Certificates shall be mutilated, lost, stolen or destroyed, the Company shall issue and the Warrant Agent shall countersign, in exchange and substitution for and upon cancellation of the mutilated Warrant Certificate, or in lieu of and substitution for the Warrant Certificate lost, stolen or destroyed, a new Warrant Certificate of like tenor and representing an equivalent number of Warrants, but only upon receipt of evidence satisfactory to the Company and the Warrant Agent of such loss, theft or destruction of such Warrant Certificate and indemnity, also satisfactory to the Company and the Warrant Agent. Applicants for such new Warrant Certificates must pay such reasonable charges as the Company may prescribe.", "section_full_title": "SECTION 8.Mutilated or Missing Warrant Certificates.", "document_id": "103uLzqu45vthv8iYk5jJu.", "section_title": "Mutilated or Missing Warrant Certificates."}, {"text": "  The Company will at all times reserve and keep available, free from preemptive rights, out of the aggregate of its authorized but unissued Ordinary Shares or its authorized and issued Ordinary Shares held in its treasury, for the purpose of enabling it to satisfy any obligation to issue Warrant Shares upon exercise of Warrants, the maximum number of Ordinary Shares which may then be deliverable upon the exercise of all outstanding Warrants. The Warrant Agent shall have no duty to verify availability of such shares set aside by the Company. The Company or, if appointed, the registrar for the Ordinary Shares (the Registrar) and every subsequent Registrar for any Ordinary Shares issuable upon the exercise of any of the Warrants will be irrevocably authorized and directed at all times to reserve such number of authorized shares as shall be required for such purpose. The Company will keep a copy of this Agreement on file with the Registrar and with every subsequent Registrar for any Ordinary Shares issuable upon the exercise of the Warrants. The Warrant Agent is hereby irrevocably authorized to instruct from time to time from the Registrar to issue the Ordinary Share certificates required to honor outstanding Warrants upon exercise thereof in accordance with the terms of this Agreement. The Company will supply such Registrar with duly executed certificates for such purposes. The Company will furnish such Registrar a copy of all notices of adjustments and certificates related thereto, transmitted to each holder pursuant to Section 13 hereof. Before taking any action which would cause an adjustment pursuant to Section 11 hereof to reduce the Exercise Price below the then par value (if any) of the Warrant Shares, the Company will take any commercially reasonable corporate action which may, in the opinion of its counsel (which may be counsel employed by the Company), be necessary in order that the Company may validly and legally issue fully paid and nonassessable Warrant Shares at the Exercise Price as so adjusted. The Company covenants that all Ordinary Shares which may be issued upon exercise of Warrants will, upon payment of the Exercise Price therefor and issue, be fully paid, nonassessable, free of preemptive rights and free from all taxes, liens, charges and security interests with respect to the issue thereof.", "section_full_title": "SECTION 9.Reservation of Warrant Shares.", "document_id": "103uLzqu45vthv8iYk5jJu.", "section_title": "Reservation of Warrant Shares."}, {"text": "  The Company will from time to time take all commercially reasonable actions which may be necessary so that the Warrant Shares, immediately upon their 5 issuance upon the exercise of Warrants, will be listed on the principal securities exchanges and markets within the United States of America, if any, on which the ADSs are then listed. To the extent that the ADSs are not listed on a national securities exchange or there is no exemption from state blue sky securities laws for the issuance of the Warrant Shares, the Company will take all commercially reasonable actions which may be necessary so that the Warrant Shares are registered in all states in which the holders of the Warrants reside.", "section_full_title": "SECTION 10.Obtaining Stock Exchange Listings.", "document_id": "103uLzqu45vthv8iYk5jJu.", "section_title": "Obtaining Stock Exchange Listings."}, {"text": "  The number of Warrant Shares issuable upon the exercise of each Warrant is subject to adjustment from time to time upon the occurrence of the events enumerated in this Section 11. (a)Stock Dividends  Split-Ups If after the date hereof, and subject to the provisions of Section 12 hereof, the number of outstanding Ordinary Shares is increased by a stock dividend payable in Ordinary Shares, or by a split-up of Ordinary Shares, or other similar event, then, on the effective date of such stock dividend, split-up or similar event, the number of Ordinary Shares issuable on exercise of each Warrant shall be increased in proportion to such increase in outstanding Ordinary Shares. (b)Aggregation of Shares If after the date hereof, and subject to the provisions of Section 12 hereof, the number of outstanding Ordinary Shares is decreased by a consolidation, combination, reverse stock split or reclassification of Ordinary Shares or other similar event, then, on the effective date of such consolidation, combination, reverse stock split, reclassification or similar event, the number of Ordinary Shares issuable on exercise of each Warrant shall be decreased in proportion to such decrease in outstanding Ordinary Shares. (c)Merger, Reorganization, etc In case of any reclassification or reorganization of the outstanding Ordinary Shares (other than a change covered by Section 11(a) or 11(b) hereof or that solely affects the par value of such Ordinary Shares), or in the case of any merger or consolidation of the Company with or into another corporation (other than a consolidation or merger in which the Company is the continuing corporation and that does not result in any reclassification or reorganization of the outstanding Ordinary Shares), or in the case of any sale or conveyance to another corporation or entity of the assets or other property of the Company as an entirety or substantially as an entirety in connection with which the Company is dissolved, the Warrant holders shall thereafter have the right to purchase and receive, upon the basis and upon the terms and conditions specified in the Warrants and in lieu of the Ordinary Shares of the Company immediately theretofore purchasable and receivable upon the exercise of the rights represented thereby, the kind and amount of shares of stock or other securities or property (including cash) receivable upon such reclassification, reorganization, merger or consolidation, or upon a dissolution following any such sale or transfer, that the Warrant holder would have received if such Warrant holder had exercised his, her or its Warrant(s) immediately prior to such event; and if any reclassification also results in a change in Ordinary Shares covered by Section 11(a) or 11(b) hereof, then such adjustment shall be made pursuant to Sections 11(a), 11(b), and 11(d) hereof and this Section 11(c). The provisions of this Section 11(c) shall similarly apply to successive reclassifications, reorganizations, mergers or consolidations, sales or other transfers. (d)Extraordinary Dividends If the Company distributes to all holders of its Ordinary Shares any of its assets (including cash) or debt securities or any rights, options or warrants to purchase debt securities, assets or other securities of the Company (other than Ordinary Shares), the number of Ordinary Shares issuable upon exercise of each Warrant shall be adjusted in accordance with the formula: N = N x M M - F where: N = the adjusted number of Ordinary Shares issuable upon exercise of each Warrant. N = the current number of Ordinary Shares issuable upon exercise of each Warrant. M = one third of the Closing Price per ADS on the Business Day immediately preceding the ex-dividend date for such distribution. F = the fair market value on the ex-dividend date for such distribution of the assets, securities, options, rights or warrants distributable to one Ordinary Share after taking into account, in the case of any rights, 6 options or warrants, the consideration required to be paid upon exercise thereof. The Board of Directors (the Board) shall reasonably determine the fair market value in good faith. The adjustment shall be made successively whenever any such distribution is made and shall become effective immediately after the record date for the determination of stockholders entitled to receive such distribution. This subsection (d) does not apply to any dividends or distributions made in connection with, or as part of, (i) regular quarterly or other periodic dividends; or (ii) any of the actions contemplated by Sections 11(a), 11(b) or 11(e). If any adjustment is made pursuant to this subsection (d) as a result of the issuance of rights, options or warrants and at the end of the period during which any such rights, options or warrants are exercisable, not all such rights, options or warrants shall have been exercised, the Warrant shall be immediately readjusted as if F in the above formula was the fair market value on the ex-dividend date for such distribution of the indebtedness or assets actually distributed upon exercise of such rights, options or warrants divided by the number of Ordinary Shares outstanding on the ex-dividend date for such distribution. Notwithstanding anything to the contrary contained in this subsection (d), if M-F in the above formula is less than $1.00, the Company may elect to, or if M-F is a negative number, the Company shall, in lieu of the adjustment otherwise required by this subsection (d), distribute to the holders of the Warrants, upon exercise thereof, the evidences of indebtedness, assets, rights, options or warrants (or the proceeds thereof) which would have been distributed to such holders had such Warrants been exercised immediately prior to the record date for such distribution. (e)Adjustments To Exercise Price Whenever the number of Ordinary Shares purchasable upon the exercise of the Warrants is adjusted, as provided in Sections 11(a) and 11(b) hereof, the Exercise Price shall be adjusted (to the nearest cent) by multiplying such Exercise Price immediately prior to such adjustment by a fraction (A) the numerator of which shall be the number of Ordinary Shares purchasable upon the exercise of the Warrants immediately prior to such adjustment, and (B) the denominator of which shall be the number of Ordinary Shares so purchasable immediately thereafter. (f)Form of Warrant The form of Warrant need not be changed because of any adjustment pursuant to this Section 11, and Warrants issued after such adjustment may state the same Exercise Price and the same number of shares as is stated in the Warrants initially issued pursuant to this Agreement. However, the Company may at any time in its sole discretion make any change in the form of Warrant that the Company may deem appropriate and that does not affect the substance thereof, and any Warrant thereafter issued or countersigned, whether in exchange or substitution for an outstanding Warrant or otherwise, may be in the form as so changed. (g)Notices of Changes in Warrant Upon every adjustment of the Exercise Price or the number of shares issuable upon exercise of a Warrant, the Company shall give written notice thereof to the Warrant Agent, which notice shall state the Exercise Price resulting from such adjustment and the increase or decrease, if any, in the number of shares purchasable at such price upon the exercise of a Warrant, setting forth in reasonable detail the method of calculation and the facts upon which such calculation is based. Upon the occurrence of any event specified in Sections 11(a), 11(b), 11(c) or 11(e), then, in any such event, the Company shall give written notice to each Warrant holder, at the last address set forth for such holder in the warrant register, of the record date or the effective date of the event. Failure to give such notice, or any defect therein, shall not affect the legality or validity of such event. (h)Notice of Certain Transactions In the event that the Company shall propose to (a) offer the holders of its Ordinary Shares rights to subscribe for or to purchase any securities convertible into Ordinary Shares or shares of capital stock of any class or any other securities, rights or options, (b) issue any rights, options or warrants to the holders of Ordinary Shares entitling them to subscribe for Ordinary Shares or (c) make a tender offer or exchange offer with respect to the Ordinary Shares, the Company shall send to the Warrant holders and file with the Warrant Agent a notice of such proposed action or offer. Such notice shall be mailed to the registered holders at their addresses as they appear in the warrant register, and, shall specify the record date for, or the date such offer or issuance is to take place and the date of participation therein by the holders of Ordinary Shares, if any such date is to be. Such notice shall be given as promptly as practicable after the Board has determined to take any such action and (x) in the case of any action covered by clause (a) or (b) above at least 10 days prior to the record date for determining the holders of the Ordinary Shares for purposes of such action or (y) in the case of any other such action at least 20 days prior to the date of the taking of such proposed action or the date of participation therein by the holders of Ordinary Shares, whichever shall be the earlier. 7 (i)Other Events If any event occurs as to which the foregoing provisions of this Section 11 are not strictly applicable or, if strictly applicable, would not, in the good faith judgment of the Board, fairly and adequately protect the purchase rights of the registered holders of the Warrants in accordance with the essential intent and principles of such provisions, then the Board shall make such adjustments in the application of such provisions, in accordance with such essential intent and principles, as shall be reasonably necessary, in the good faith opinion of the Board, to protect such purchase rights as aforesaid.", "section_full_title": "SECTION 11.Adjustment of Number of Warrant Shares.", "document_id": "103uLzqu45vthv8iYk5jJu.", "section_title": "Adjustment of Number of Warrant Shares."}, {"text": "  Notwithstanding any provision contained in this Agreement to the contrary, the Company shall not issue fractional shares upon exercise of Warrants. If, by reason of any adjustment made pursuant to this Section 12, the holder of any Warrant would be entitled, upon the exercise of such Warrant, to receive a fractional interest in a share, the Company shall, upon such exercise, round up to the nearest whole number of the Ordinary Shares to be issued to the Warrant holder.", "section_full_title": "SECTION 12.Fractional Interests.", "document_id": "103uLzqu45vthv8iYk5jJu.", "section_title": "Fractional Interests."}, {"text": "  Upon any adjustment of the Exercise Price pursuant to Section 11, the Company shall promptly thereafter, and in any event within five days, (i) cause to be filed with the Warrant Agent a certificate executed by the Chief Financial Officer or principal financial officer of the Company setting forth the number of Warrant Shares issuable upon exercise of each Warrant after such adjustment and setting forth in reasonable detail the method of calculation and the facts upon which such calculations are based, and (ii) cause to be given to each of the registered holders of the Warrant Certificates at his address appearing on the Warrant register written notice of such adjustments by first-class mail, postage prepaid. Where appropriate, such notice may be given in advance and included as a part of the notice required to be mailed under the other provisions of this Section 13. The Warrant Agent shall be fully protected in relying on any such certificate and on any adjustment therein contained and shall not be deemed to have knowledge of such adjustment unless and until it shall have received such certificate. In case: (a) the Company shall authorize the issuance to all holders of Ordinary Shares of rights, options or warrants to subscribe for or purchase Ordinary Shares or of any other subscription rights or warrants; or (b) the Company shall authorize the distribution to all holders of Ordinary Shares of evidences of its indebtedness or assets (other than regular cash dividends or dividends payable in Ordinary Shares or distributions referred to in subsection (b) of Section 11 hereof); or (c) of any consolidation or merger to which the Company is a party and for which approval of any shareholders of the Company is required, or of the conveyance or transfer of the properties and assets of the Company substantially as an entirety, or of any reclassification or change of Ordinary Shares issuable upon exercise of the Warrants (other than a change in par value, or from par value to no par value, or from no par value to par value, or as a result of a subdivision or combination), or a tender offer or exchange offer for Ordinary Shares; or (d) of the voluntary or involuntary dissolution, liquidation or winding up of the Company; or (e) the Company proposes to take any action not specified above which would require an adjustment of the Exercise Price pursuant to Section 11 hereof; then the Company shall cause to be filed with the Warrant Agent and shall cause to be given to each of the registered holders of the Warrant Certificates at his address appearing on the Warrant register, at least 10 calendar days prior to the applicable record date hereinafter specified, or as promptly as practicable under the circumstances in the case of events for which there is no record date, by first-class mail, postage prepaid, a written notice stating (i) the date as of which the holders of record of Ordinary Shares to be entitled to receive any such rights, options, warrants or distribution are to be determined, or (ii) the initial expiration date set forth in any tender offer or exchange offer for Ordinary Shares, or (iii) the date on which any such consolidation, merger, conveyance, transfer, dissolution, liquidation or winding up is expected to become effective or consummated, and the date as of which it is expected that holders of record of Ordinary Shares shall be entitled to exchange such shares for securities or other property, if any, deliverable upon such reclassification, consolidation, merger, conveyance, transfer, dissolution, liquidation or winding up. The failure to give the notice required by this Section 13 or any defect therein shall not affect the legality or validity of any distribution, right, option, warrant, consolidation, merger, conveyance, transfer, dissolution, liquidation or winding up, or the vote upon any action. 8 Nothing contained in this Agreement or in any of the Warrant Certificates shall be construed as conferring upon the holders thereof the right to vote or to consent or to receive notice as shareholders in respect of the meetings of shareholders or the election of directors of the Company or any other matter, or any rights whatsoever as shareholders of the Company.", "section_full_title": "SECTION 13.Notice to Warrant Holders.", "document_id": "103uLzqu45vthv8iYk5jJu.", "section_title": "Notice to Warrant Holders."}, {"text": "  Any corporation into which the Warrant Agent may be merged or with which it may be consolidated, or any corporation resulting from any merger or consolidation to which the Warrant Agent shall be a party, or any corporation succeeding to all or substantially all the corporate trust or agency business of the Warrant Agent, shall be the successor to the Warrant Agent hereunder without the execution or filing of any paper or any further act on the part of any of the parties hereto, provided that such corporation would be eligible for appointment as a successor warrant agent under the provisions of Section 16 hereof. In case at the time such successor to the Warrant Agent shall succeed to the agency created by this Agreement, and in case at that time any of the Warrant Certificates shall have been countersigned but not delivered, any such successor to the Warrant Agent may adopt the countersignature of the original Warrant Agent; and in case at that time any of the Warrant Certificates shall not have been countersigned, any successor to the Warrant Agent may countersign such Warrant Certificates either in the name of the predecessor Warrant Agent or in the name of the successor to the Warrant Agent; and in all such cases such Warrant Certificates shall have the full force and effect provided in the Warrant Certificates and in this Agreement. In case at any time the name of the Warrant Agent shall be changed and at such time any of the Warrant Certificates shall have been countersigned but not delivered, the Warrant Agent whose name has been changed may adopt the countersignature under its prior name, and in case at that time any of the Warrant Certificates shall not have been countersigned, the Warrant Agent may countersign such Warrant Certificates either in its prior name or in its changed name, and in all such cases such Warrant Certificates shall have the full force and effect provided in the Warrant Certificates and in this Agreement.", "section_full_title": "SECTION 14.Merger, Consolidation or Change of Name of Warrant Agent.", "document_id": "103uLzqu45vthv8iYk5jJu.", "section_title": "Merger, Consolidation or Change of Name of Warrant Agent."}, {"text": "  The Warrant Agent undertakes the duties and obligations imposed by this Agreement (and no implied duties or obligations shall be read into this Agreement against the Warrant Agent) upon the following terms and conditions, by all of which the Company and the holders of Warrants, by their acceptance thereof, shall be bound: (a) The statements contained herein and in the Warrant Certificates shall be taken as statements of the Company and the Warrant Agent assumes no responsibility for the correctness of any of the same except to the extent that any such statements describe the Warrant Agent or action taken or to be taken by it The Warrant Agent assumes no responsibility with respect to the distribution of the Warrant Certificates except as otherwise provided herein. (b) The Warrant Agent shall not be responsible for any failure of the Company to comply with any of the covenants contained in this Agreement or in the Warrant Certificates to be complied with by the Company (c) The Warrant Agent may consult at any time with counsel of its own selection (who may be counsel for the Company) and the Warrant Agent shall incur no liability or responsibility to the Company or to any holder of any Warrant Certificate in respect of any action taken, suffered or omitted by it hereunder in good faith and in accordance with the opinion or the advice of such counsel. The Warrant Agent may execute any of the trusts or powers hereunder or perform any duties hereunder either directly or through agents or attorneys and the Warrant Agent shall not be responsible for any misconduct or negligence on the part of any agent or attorney appointed with due care by it hereunder. (d) The Warrant Agent may conclusively rely, as to the truth of the statements and the correctness of the opinions expressed therein, upon certificates or opinions furnished to the Warrant Agent and conforming to the requirements of this Agreement The Warrant Agent shall incur no liability or responsibility to the Company or to any holder of any Warrant Certificate for any action taken in reliance on any Warrant Certificate, certificate of shares, notice, resolution, waiver, consent, order, certificate, or other paper, document or instrument (whether in its original or facsimile form) believed by it to be genuine and to have been signed, sent or presented by the proper party or parties. 9 (e) The Company hereby agrees to (A) pay to the Warrant Agent such compensation for all services rendered by the Warrant Agent in the administration and execution of this Agreement as the Company and the Warrant Agent shall agree to in writing, (B) reimburse the Warrant Agent for all expenses, taxes and governmental charges and other charges of any kind and nature incurred by the Warrant Agent in the execution of this Agreement (including fees and expenses of its counsel) and (C) indemnify the Warrant Agent (and any predecessor Warrant Agent) and hold it harmless against any and all claims (whether asserted by the Company, a holder or any other person), damages, losses, expenses (including taxes other than taxes based on the income of the Warrant Agent) and liabilities (including judgments, costs and counsel fees and expenses), suffered or incurred by the Warrant Agent for anything done or omitted by the Warrant Agent in the execution of this Agreement except as a result of its gross negligence or willful misconduct The provisions of this Section 15(e) shall survive the expiration of the Warrants and the termination of this Agreement. (f) The Warrant Agent shall be under no obligation to institute any action, suit or legal proceeding or to take any other action likely to involve expense unless the Company or one or more registered holders of Warrant Certificates shall furnish the Warrant Agent with security and indemnity satisfactory to it for any costs and expenses which may be incurred, but this provision shall not affect the power of the Warrant Agent to take such action as it may consider proper, whether with or without any such security or indemnity All rights of action under this Agreement or under any of the Warrants may be enforced by the Warrant Agent without the possession of any of the Warrant Certificates or the production thereof at any trial or other proceeding relative thereto, and any such action, suit or proceeding instituted by the Warrant Agent shall be brought in its name as Warrant Agent and any recovery of judgment shall be for the ratable benefit of the registered holders of the Warrants, as their respective rights or interests may appear. (g) The Warrant Agent, and any stockholder, director, officer or employee of it, may buy, sell or deal in any of the Warrants or other securities of the Company or become pecuniarily interested in any transaction in which the Company may be interested, or contract with or lend money to the Company or otherwise act as fully and freely as though it were not Warrant Agent under this Agreement Nothing herein shall preclude the Warrant Agent from acting in any other capacity for the Company or for any other legal entity. (h) The Warrant Agent shall act hereunder solely as agent for the Company, and its duties shall be determined solely by the provisions hereof The Warrant Agent shall not be liable for anything which it may do or refrain from doing in connection with this Agreement except for its own gross negligence or willful misconduct. The Warrant Agent shall not be liable for any error of judgment made in good faith by it, unless it shall be proved that the Warrant Agent was negligent in ascertaining the pertinent facts. Notwithstanding anything in this Agreement to the contrary, in no event shall the Warrant Agent be liable for any special, indirect, punitive or consequential loss or damage of any kind whatsoever (including but not limited to lost profits), even if the Warrant Agent has been advised of the likelihood of the loss or damage and regardless of the form of the action. (i) The Warrant Agent shall not at any time be under any duty or responsibility to any holder of any Warrant Certificate to make or cause to be made any adjustment of the Exercise Price or number of the Warrant Shares or other securities or property deliverable as provided in this Agreement, or to determine whether any facts exist which may require any such adjustments, or with respect to the nature or extent of any such adjustments, when made, or with respect to the method employed in making the same The Warrant Agent shall not be accountable with respect to the validity or value or the kind or amount of any Warrant Shares or of any securities or property which may at any time be issued or delivered upon the exercise of any Warrant or with respect to whether any such Warrant Shares or other securities will when issued be validly issued and fully paid and nonassessable, and makes no representation with respect thereto. (j) Notwithstanding anything in this Agreement to the contrary, neither the Company nor the Warrant Agent shall have any liability to any holder of a Warrant Certificate or other Person as a result of its inability to perform any of its obligations under this Agreement by reason of any preliminary or permanent injunction or other order, decree or ruling issued by a court of competent jurisdiction or by a governmental, regulatory or administrative agency or commission, or any statute, rule, regulation or executive order promulgated or enacted by any governmental authority prohibiting or otherwise restraining performance of such obligation; provided, however that (A) the Company must use its reasonable best efforts to have any such order, decree or ruling lifted or otherwise overturned as soon as possible and (B) nothing in this Section 15(j) shall affect the Companys obligation under 10 Section 6(d) hereof to use its best efforts to have a registration statement in effect covering the Warrant Shares issuable upon exercise of the Warrants and to maintain a current prospectus relating to those Warrant Shares. (k) Any application by the Warrant Agent for written instructions from the Company may, at the option of the Warrant Agent, set forth in writing any action proposed to be taken or omitted by the Warrant Agent under this Agreement and the date on and/or after which such action shall be taken or such omission shall be effective The Warrant Agent shall not be liable for any action taken by, or omission of, the Warrant Agent in accordance with a proposal included in such application on or after the date specified in such application (which date shall not be less than three Business Days after the date any officer of the Company actually receives such application, unless any such officer shall have consented in writing to any earlier date) unless prior to taking any such action (or the effective date in the case of an omission), the Warrant Agent shall have received written instructions in response to such application specifying the action to be taken or omitted. (l) No provision of this Agreement shall require the Warrant Agent to expend or risk its own funds or otherwise incur any financial liability in the performance of any of its duties hereunder or in the exercise of its rights (m) In addition to the foregoing, the Warrant Agent shall be protected and shall incur no liability for, or in respect of, any action taken or omitted by it in connection with its administration of this Agreement if such acts or omissions are not the result of the Warrant Agents reckless disregard of its duty, gross negligence or willful misconduct and are in reliance upon (A) the proper execution of the certification concerning beneficial ownership appended to the form of assignment and the form of the election attached hereto unless the Warrant Agent shall have actual knowledge that, as executed, such certification is untrue, or (B) the non-execution of such certification including, without limitation, any refusal to honor any otherwise permissible assignment or election by reason of such non-execution.", "section_full_title": "SECTION 15.Warrant Agent.", "document_id": "103uLzqu45vthv8iYk5jJu.", "section_title": "Warrant Agent."}, {"text": "  The Warrant Agent may at any time resign as Warrant Agent upon written notice to the Company. If the Warrant Agent shall become incapable of acting as Warrant Agent hereunder, the Company shall appoint a successor to such Warrant Agent. If the Company shall fail to make such appointment within a period of 30 days after it has been notified in writing of such resignation or of such incapacity by the Warrant Agent or by the registered holder of a Warrant Certificate, then the registered holder of any Warrant Certificate or the Warrant Agent may apply, at the expense of the Company, to any court of competent jurisdiction for the appointment of a successor to the Warrant Agent. Pending appointment of a successor to such Warrant Agent, either by the Company or by such a court, the duties of the Warrant Agent shall be carried out by the Company. The holders of a majority of the unexercised Warrants shall be entitled at any time to remove the Warrant Agent and appoint a successor to such Warrant Agent. If a successor to the Warrant Agent shall not have been appointed within 30 days of such removal, the Warrant Agent may apply, at the expense of the Company, to any court of competent jurisdiction for the appointment of a successor to the Warrant Agent. Such successor to the Warrant Agent need not be approved by the Company or the former Warrant Agent. After appointment, the successor to the Warrant Agent shall be vested with the same powers, rights, duties and responsibilities as if it had been originally named as Warrant Agent without further act or deed; but the former Warrant Agent upon payment of all fees and expenses due it and its agents and counsel shall deliver and transfer to the successor to the Warrant Agent any property at the time held by it hereunder and execute and deliver any further assurance, conveyance, act or deed necessary for the purpose. Failure to give any notice provided for in this Section 16, however, or any defect therein, shall not affect the legality or validity of the appointment of a successor to the Warrant Agent.", "section_full_title": "SECTION 16.Change of Warrant Agent.", "document_id": "103uLzqu45vthv8iYk5jJu.", "section_title": "Change of Warrant Agent."}, {"text": "  Any notice or demand authorized by this Agreement to be given or made by the Warrant Agent or by the registered holder of any Warrant Certificate to or on the Company shall be sufficiently given or made when and if deposited in the mail, first class or registered, postage prepaid, addressed (until another address is filed in writing by the Company with the Warrant Agent), as follows: China Hydroelectric Corporation 420 Lexington, Suite 860 New York, NY 10170 Attention: Chief Executive Officer and President 11 In case the Company shall fail to maintain such office or agency or shall fail to give such notice of the location or of any change in the location thereof, presentations may be made and notices and demands may be served at the principal corporate trust office of the Warrant Agent. Any notice pursuant to this Agreement to be given by the Company or by the registered holder(s) of any Warrant Certificate to the Warrant Agent shall be sufficiently given when and if deposited in the mail, first-class or registered, postage prepaid, addressed (until another address is filed in writing by the Warrant Agent with the Company) to the Warrant Agent as follows: []", "section_full_title": "SECTION 17.Notices to Company and Warrant Agent.", "document_id": "103uLzqu45vthv8iYk5jJu.", "section_title": "Notices to Company and Warrant Agent."}, {"text": "  The Company and the Warrant Agent may from time to time supplement or amend this Agreement without the approval of any holders of Warrant Certificates in order to cure any ambiguity or to correct or supplement any provision contained herein which may be defective or inconsistent with any other provision herein, or to make any other provisions in regard to matters or questions arising hereunder which the Company and the Warrant Agent may deem necessary or desirable and which shall not in any way adversely affect the interests of the holders of Warrant Certificates theretofore issued. Upon the delivery of a certificate from an appropriate officer of the Company which states that the proposed supplement or amendment is in compliance with the terms of this Section 18, the Warrant Agent shall execute such supplement or amendment. Notwithstanding anything in this Agreement to the contrary, the prior written consent of the Warrant Agent must be obtained in connection with any supplement or amendment which alters the rights or duties of the Warrant Agent. The Company and the Warrant Agent may amend any provision herein with the consent of the holders of Warrants exercisable for a majority of the Warrant Shares issuable on exercise of all outstanding Warrants that would be affected by such amendment.", "section_full_title": "SECTION 18.Supplements and Amendments.", "document_id": "103uLzqu45vthv8iYk5jJu.", "section_title": "Supplements and Amendments."}, {"text": "  All the covenants and provisions of this Agreement by or for the benefit of the Company or the Warrant Agent shall bind and inure to the benefit of their respective successors and assigns hereunder.", "section_full_title": "SECTION 19.Successors.", "document_id": "103uLzqu45vthv8iYk5jJu.", "section_title": "Successors."}, {"text": "  This Agreement will terminate on any earlier date if all Warrants have been exercised or expired without exercise. The provisions of Section 15 hereof shall survive such termination.", "section_full_title": "SECTION 20.Termination.", "document_id": "103uLzqu45vthv8iYk5jJu.", "section_title": "Termination."}, {"text": "  This Agreement and each Warrant Certificate issued hereunder shall be deemed to be a contract made under the laws of the State of New York and for all purposes shall be construed in accordance with the internal laws of the State of New York. The parties agree that all actions and proceedings arising out of this Agreement or any of the transactions contemplated hereby shall be brought in the United States District Court for the Southern District of New York or in a New York State Court in the County of New York and that, in connection with any such action or proceeding, the parties will submit to the jurisdiction of, and venue in, such court. Each of the parties hereto also irrevocably waives all right to trial by jury in any action, proceeding or counterclaim arising out of this Agreement or the transactions contemplated hereby.", "section_full_title": "SECTION 21.Governing Law.", "document_id": "103uLzqu45vthv8iYk5jJu.", "section_title": "Governing Law."}, {"text": "  Nothing in this Agreement shall be construed to give to any person or corporation other than the Company, the Warrant Agent and the registered holders of the Warrant Certificates any legal or equitable right, remedy or claim under this Agreement, and this Agreement shall be for the sole and exclusive benefit of the Company, the Warrant Agent and the registered holders of the Warrant Certificates.", "section_full_title": "SECTION 22.Benefits of This Agreement.", "document_id": "103uLzqu45vthv8iYk5jJu.", "section_title": "Benefits of This Agreement."}, {"text": "  This Agreement may be executed in any number of counterparts and each of such counterparts shall for all purposes be deemed to be an original, and all such counterparts shall together constitute but one and the same instrument.", "section_full_title": "SECTION 23.Counterparts.", "document_id": "103uLzqu45vthv8iYk5jJu.", "section_title": "Counterparts."}, {"text": "  In no event shall the Warrant Agent be responsible or liable for any failure or delay in the performance of its obligations under this Agreement arising out of or caused by, directly or indirectly, forces beyond its reasonable control, including without limitation strikes, work stoppages, accidents, acts of war or terrorism, civil or military disturbances, nuclear or natural catastrophes or acts of God, and interruptions, loss or malfunctions of utilities, communications or computer (software or hardware) services. [SIGNATURE PAGE FOLLOWS] 12 IN WITNESS WHEREOF, the parties hereto have caused this Agreement to be duly executed as of the date first above written. CHINA HYDROELECTRIC CORPORATION By: Name: Title: as Warrant Agent By: Name: Title: 13 EXHIBIT A [Form of Warrant Certificate] [FACE] Number Warrants THIS WARRANT WILL BE VOID IF NOT EXERCISED PRIOR TO 5:00 P.M. NEW YORK CITY TIME, , 2014 CHINA HYDROELECTRIC CORPORATION a Cayman Islands company CUSIP: Warrant Certificate This Warrant Certificate certifies that is the registered holder of  warrants (the Warrants) to purchase ordinary shares, par value $0.001 per share (the Ordinary Shares), of China Hydroelectric Corporation, a Cayman Islands company (the Company). Each Warrant entitles the holder, upon exercise during the period set forth in the Warrant Agreement referred to below, to receive from the Company that number of fully paid and nonassessable Ordinary Shares (each, a Warrant Share) as set forth below, at the exercise price (the Exercise Price) as determined pursuant to the Warrant Agreement, payable as provided in the Warrant Agreement upon surrender of this Warrant Certificate and payment of the Exercise Price at the office or agency of the Warrant Agent referred to below, subject to the conditions set forth herein and in the Warrant Agreement. Defined terms used in this Warrant Certificate but not defined herein shall have the meanings given to them in the Warrant Agreement. Each Warrant is initially exercisable for three fully paid and non-assessable Ordinary Shares. The number of Warrant Shares issuable upon exercise of the Warrants are subject to adjustment upon the occurrence of certain events set forth in the Warrant Agreement. The initial Exercise Price for any Warrant is equal to $15.00 for every three Ordinary Shares. The Exercise Price is subject to adjustment upon the occurrence of certain events set forth in the Warrant Agreement. Warrants may be exercised only during the Warrant Exercise Period subject to the conditions set forth in the Warrant Agreement and to the extent not exercised by the end of such Warrant Exercise Period such Warrants shall become void. Reference is hereby made to the further provisions of this Warrant Certificate set forth on the reverse hereof and such further provisions shall for all purposes have the same effect as though fully set forth at this place. This Warrant Certificate shall not be valid unless countersigned by the Warrant Agent, as such term is used in the Warrant Agreement. This Warrant Certificate shall be governed and construed in accordance with the internal laws of the State of New York, without regard to conflicts of laws principles thereof. CHINA HYDROELECTRIC CORPORATION By: Name: John Kuhns Title: Chief Executive Officer By: Name: Mary Fellows Title: Secretary Countersigned: Dated: as Warrant Agent By Authorized Signatory 14 [Form of Warrant Certificate] [Reverse] The Warrants evidenced by this Warrant Certificate are part of a duly authorized issue of Warrants entitling the holder on exercise to receive Ordinary Shares and are issued or to be issued pursuant to a Warrant Agreement dated as of [ ], 2010 (the Warrant Agreement), duly executed and delivered by the Company to [The Bank of New York Mellon] (the Warrant Agent), which Warrant Agreement is hereby incorporated by reference in and made a part of this instrument and is hereby referred to for a description of the rights, limitation of rights, obligations, duties and immunities thereunder of the Warrant Agent, the Company and the holders (the words holders or holder meaning the registered holders or registered holder) of the Warrants. A copy of the Warrant Agreement may be obtained by the holder hereof upon written request to the Company. Defined terms used in this Warrant Certificate but not defined herein shall have the meanings given to them in the Warrant Agreement. Warrants may be exercised at any time during the Warrant Exercise Period set forth in the Warrant Agreement. The holder of Warrants evidenced by this Warrant Certificate may exercise them by surrendering this Warrant Certificate, with the form of Election to Purchase set forth hereon properly completed and executed, together with payment of the Exercise Price as specified in the Warrant Agreement at the principal corporate trust office of the Warrant Agent. In the event that upon any exercise of Warrants evidenced hereby the number of Warrants exercised shall be less than the total number of Warrants evidenced hereby, there shall be issued to the holder hereof or his assignee a new Warrant Certificate evidencing the number of Warrants not exercised. No adjustment shall be made for any dividends on any Ordinary Shares issuable upon exercise of this Warrant. Notwithstanding anything else in this Warrant Certificate or the Warrant Agreement, no Warrant may be exercised unless at the time of exercise (i) a registration statement covering the Warrant Shares to be issued upon exercise of the Warrants is effective under the Act and (ii) a prospectus thereunder relating to the Warrant Shares is current. In no event shall the Company be required to issue unregistered shares upon the exercise of any Warrant or settle warrants on a net cash basis. The Company may call the Warrants for redemption, in whole and not in part, at a price of $0.01 per Warrant, upon not less than 30 days prior written notice of redemption to each Warrant holder, at any time after such Warrants have become exercisable, if, and only if, (A) the Closing Price has equaled or exceeded $23.00 per ADS for any 20 trading days within a 30-trading-day period ending on the third Business Day prior to the notice of redemption to Warrant holders and (B) at all times between the date of such notice of redemption and the redemption date a registration statement filed pursuant to the Securities Act is in effect covering the Warrant Shares issuable upon exercise of the Warrants and a current prospectus relating to those Warrant Shares is available. The Warrant Agreement provides that upon the occurrence of certain events the number of Warrant Shares set forth on the face hereof may, subject to certain conditions, be adjusted. If, upon exercise of a Warrant, the holder thereof would be entitled to receive a fractional interest in an Ordinary Share, the Company will, upon exercise, round up to the nearest whole number of Ordinary Shares to be issued to the Warrant holder. Warrant Certificates, when surrendered at the principal corporate trust office of the Warrant Agent by the registered holder thereof in person or by legal representative or attorney duly authorized in writing, may be exchanged, in the manner and subject to the terms of the Warrant Agreement, for another Warrant Certificate or Warrant Certificates of like tenor evidencing in the aggregate a like number of Warrants. Upon due presentation for registration of transfer of this Warrant Certificate at the office of the Warrant Agent a new Warrant Certificate or Warrant Certificates of like tenor and evidencing in the aggregate a like number of Warrants shall be issued to the transferee(s) in exchange for this Warrant Certificate, subject to the terms of the Warrant Agreement. The Company and the Warrant Agent may deem and treat the registered holder(s) thereof as the absolute owner(s) of this Warrant Certificate (notwithstanding any notation of ownership or other writing hereon made by anyone), for the purpose of any exercise hereof, of any distribution to the holder(s) hereof, and for all other 15 purposes, and neither the Company nor the Warrant Agent shall be affected by any notice to the contrary. Neither the Warrants nor this Warrant Certificate entitles any holder hereof to any rights of a security holder of the Company. Election to Purchase (To Be Executed Upon Exercise Of Warrant) The undersigned hereby irrevocably elects to exercise the right, represented by this Warrant Certificate, to receive  Ordinary Shares and herewith tenders payment for such shares to the order of China Hydroelectric Corporation in the amount of $ in accordance with the terms hereof. The undersigned requests that a certificate for such shares be registered in the name of , whose address is and that such shares be delivered to  whose address is . If said number of shares is less than all of the Ordinary Shares purchasable hereunder, the undersigned requests that a new Warrant Certificate representing the remaining balance of such shares be registered in the name of , whose address is , and that such Warrant Certificate be delivered to , whose address is . Date: (Signature) (Address) (Tax Identification Number) Signature Guaranteed: THE SIGNATURE(S) SHOULD BE GUARANTEED BY AN ELIGIBLE GUARANTOR INSTITUTION (BANKS, STOCKBROKERS, SAVINGS AND LOAN ASSOCIATIONS AND CREDIT UNIONS WITH MEMBERSHIP IN AN APPROVED SIGNATURE GUARANTEE MEDALLION PROGRAM, PURSUANT TO S.E.C. RULE 17Ad-15). 16", "section_full_title": "SECTION 24.Force Majeure.", "document_id": "103uLzqu45vthv8iYk5jJu.", "section_title": "Force Majeure."}, {"text": " The parties, abiding by the principles of mutual benefit, win-win and mutual development, have reached an agreement on the principles to determine pricing for photovoltaic modules after thorough due diligence on the market conditions of upstream and downstream markets of the photovoltaic industry. Given that the benchmark price of a standard photovoltaic module is * * * and Party Bs benchmark profit margin is * * *, Party Bs profit margins corresponding to the sales prices of modules shall be as follows: Price of Modules (/W) * * * (exclusive of both numbers) * * * * * * (exclusive of both numbers) * * * Party Bs Profit Margin * * * * * * * * * * * * If Party B needs to lower the price of its module products in order to obtain purchase orders with a larger volume and in the event that sales price of the modules may be lower than 2.0/W, Party B shall not enter into any module sales agreements without the prior consent of Party A. Otherwise, Party A will not be bind by any obligations. If Party A gives its prior consent under such circumstances, both parties will agree on Party Bs profit margin on a case-by-case basis.", "section_full_title": "1. Party Bs Profit Margin", "document_id": "10bGzlgCb0B3m8oE32PNT1.", "section_title": " Party Bs Profit Margin"}, {"text": " Scope and rate of Party Bs fees shall be calculated as follow: 0.1% of damages from breakage incurred in unpacking; 0.3% of damages from breakage incurred in processing; 1% of difference between the actual output power of a cell and the theoretical power of such cells; * ** of financial costs; 1 0.05% of product liability insurance for modules; Calculation of profit margin shall be based on the table above and process cost of modules includes expenses of other raw materials, labor and utilities, etc. at the amount of * * *. During the valid period of this Agreement, where the breakage rate of unpacking is higher than 0.1%, such additional costs shall be borne by Party A and shall be deducted from the amount of products delivered; where the breakage rate of processing is higher than 0.3%, such additional costs shall be borne by Party B.", "section_full_title": "2. Scope and Rate of Party Bs Fees", "document_id": "10bGzlgCb0B3m8oE32PNT1.", "section_title": " Scope and Rate of Party Bs Fees"}, {"text": " Prices of cells (A) and modules (B) shall be converted in accordance with the following formula: * * * C% refers to the relevant profit margin, which shall be determined pursuant to sales price of modules set forth in Article 1; R refers to the exchange rate of Euro against RMB at the time of export. Given the current exchange rate (1=RMB8.6), price of cells corresponding to modules shall be as follows: price of cells corresponding to 2.0 shall be RMB15.02/W; price of cells corresponding to 2.1 shall be RMB15.76/W; price of cells corresponding to 2.2 shall be RMB16.48/W; and price of cells corresponding to 2.3 shall be RMB17.18/W. Considering the risk arising from fluctuation of exchange rates, the parties will mutually agree on a future exchange rate of Euro against RMB within the term of overseas purchase orders, and Party B shall be responsible to enter into foreign exchange forwarding arrangements to lock-up the agreed future exchange rate. If either party disagrees with such lock-up arrangement, such party shall be responsible for any exchange rate loss that may incur.", "section_full_title": "3. Conversion between Prices of Cells and Prices of Modules", "document_id": "10bGzlgCb0B3m8oE32PNT1.", "section_title": " Conversion between Prices of Cells and Prices of Modules"}, {"text": " The parties shall enter into a cell purchase agreement within 3 days after Party B confirms purchase orders from an overseas customer and gives notice to Party A, provided the sales price is within the price range provided in Article 1, or after Party B obtains consent from Party A (if the price is lower than the minimal price provided in Article 1). Sales price of cells shall be determined in accordance with provisions set forth above, and the cells shall be delivered no later than one month after the execution of a cells purchase agreement. Payment shall be made within three days upon delivery. The advance payment from Party B to Party A at the amount of RMB30 million as set forth in the Strategic Cooperation Agreement between the parties dated December 3, 2008 will be deducted from Party Bs payment to Party A in the amount equaling to 10% of each purchase price. Such deduction arrangement does not apply to the initial installment to be returned by Party A to Party B in the amount of RMB50 million. The settlement date of each cells purchase agreement shall be the day on which the refund is deducted accordingly. 2 This agreement is to supplement the Strategic Cooperation Agreement dated December 3, 2008 and shall have the same legal effect therewith. Matters that are not provided herein shall be resolved by the parties through negotiation. This agreement shall be executed in two counterparts, each of which shall be held by each party, and shall come into effect upon execution by both parties. Party A: Chongqing Daqo New Energy Co., Ltd. Party B: SUMEC Hardware & Tools Co., Ltd. Signature: /s/ Signature: /s/ (company seal) (company seal) Date: December 12, 2008 Date: December 12, 2008 Note: * Indicates where text has been omitted pursuant to a request for confidential treatment under Rule 406 of the Securities Act of 1933, as amended. The omitted materials have been filed separately with the Securities and Exchange Commission. 3", "section_full_title": "4. Performance of Cells Purchase Agreement", "document_id": "10bGzlgCb0B3m8oE32PNT1.", "section_title": " Performance of Cells Purchase Agreement"}, {"text": " This Note is one of a series of Notes of the Company in the aggregate principal amount of a minimum of Nine Million Three Hundred Thousand Dollars ($9,300,000) and up to a maximum of Twelve Million Dollars ($12,000,000.00)(collectively, the Notes) as described in that certain Confidential Private Placement Memorandum, dated December 10, 2009, delivered to the Holder in connection with the transactions contemplated by the SPA (the Memorandum).", "section_full_title": "1.Series", "document_id": "11i1Ws6jtKlAc0YkWRqMEr.", "section_title": "Series"}, {"text": " The outstanding principal amount of this Note shall be payable on the Maturity Date, unless this Note has beenearlier converted as described below.", "section_full_title": "2.Principal Repayment", "document_id": "11i1Ws6jtKlAc0YkWRqMEr.", "section_title": "Principal Repayment"}, {"text": " (a)Computation. Interest (the Interest) shall accrue on the unpaid principal amount of this Note from the date hereof until such principal amount is repaid in full at the rate of eight percent (8%) per annum, payable quarterly inarrears on the last day of each fiscal quarter of the Company (i.e., March 31, June 30, September 30 and December 31) commencing January 1, 2010.For purposes of clarity, the initial interest payment shall consist of accrued interest from the date of issuance of the Note through December 31, 2009. Thereafter, interest payments of accrued interest shall be due and payable on the last day of each fiscal quarter until the Maturity Date, subject to earlier conversion or redemption of the Note.All computations of the interest rate hereunder shall be made on the basis of a 360-day year of twelve 30-day months. In the event that any interest rate provided for herein shall be determined to be unlawful, such interest rate shall be computed at the highest rate permitted by applicable law. Any payment by the Company of any interest amount in excess of that permitted by law shall be considered a mistake, with the excess being applied to the principal of this Note without prepayment premium or penalty. (b)Closing Escrow Holdback. Pursuant to the SPA, $186,000 (if the Minimum Amount is raised) or up to $240,000 (if the Maximum Amount is raised) (the Total Holdback Amount), constituting an amount sufficient to satisfy one quarterly payment of Interest due on the aggregate principal amount of all Notes, shall be retained by the Escrow Agent and paid to the holders of the Notes and otherwise administered in accordance with the certain Closing Escrow Agreement. At such time as 75% of all Shares underlying the Notes have been issued upon conversion of Notes, if the Company is not in breach of any of the Transaction Documents, all remaining funds of the Total Holdback Amount, if any, shall be disbursed to the Company in accordance with the Closing Escrow Agreement.", "section_full_title": "3.Interest", "document_id": "11i1Ws6jtKlAc0YkWRqMEr.", "section_title": "Interest"}, {"text": " Except for the indebtedness of the Company and its Subsidiaries in existence on the date hereof as described in the Memorandum (including the financial statements that form a part thereof), and subject to the terms and conditions of this Note and the other Transaction Documents, the obligations of the Company under this Noteshall rank senior with respect toallexisting indebtedness of the Companyas of the date hereof andto any andall indebtedness incurred hereafter.The term indebtedness as used in this Section 4, refers to all unsecured debts and obligations of the Company, including trade payables.", "section_full_title": "4.Ranking", "document_id": "11i1Ws6jtKlAc0YkWRqMEr.", "section_title": "Ranking"}, {"text": " (a)Generally. Each holder of the Notes shall have the right, exercisable at any time prior to the Maturity Date, to convert all, but not less than all, of the principal amount then outstanding, plus all accrued but unpaid interest thereon, into shares of the Companys common stock, par value $0.001 per share (the Common Stock) at a conversion price (the Conversion Price) equal to $2.00 per share (the Common Stock underlying the Notes being referred to herein as the Shares). 2 (b)Mechanics of Conversion. The conversion of this Note shall be conducted in the following manner: upon any conversion of all but not less than all of the outstanding principal amount of this Note, plus all accrued but unpaid interest thereon: (i) the Holder shall deliver a completed and executed Notice of Conversion attached hereto as Exhibit A and surrender and deliver this Note, duly endorsed, to the Companys office or such other address which the Company shall designate against delivery of the certificates presenting the Shares to be delivered; (ii) in exchange for the surrendered Note, the Company shall prepare and deliver irrevocable instructions addressed to the Companys transfer and exchange agent, as applicable, to issue such required number of Shares as set forth in the Conversion Notice which Shares shall be delivered to the Holder within five (5) Business Days of the delivery of the documentation to the Company; and (iii) upon delivery of the Shares, this Note shall become fully paid and satisfied. The Company shall, upon the written request of the Holder, use its best efforts to deliver, or cause to be delivered, the Shares hereunder electronically through the Depository Trust and Clearing Corporation or another established clearing corporation performing similar functions, if available; provided, that, the Company may, but will not be required to, change its transfer agent if its current transfer agent cannot deliver the Shares electronically through the Depository Trust and Clearing Corporation. (c)Adjustments to Conversion Price. (i)Adjustments for Stock Splits and Combinations and Stock Dividends.If the Company shall at any time or from time to time after the date hereof, effect a stock split or combination of the outstanding Common Stock or pay a stock dividend in shares of Common Stock, then the Conversion Price shall be proportionately adjusted. Any adjustments under this Section 5(c)(i) shall be effective at the close of business on the date the stock split or combination becomes effective or the date of payment of the stock dividend, as applicable. (ii)Merger Sale, Reclassification, etc.In case of any (A) consolidation or merger (including a merger in which the Company is the surviving entity), (B) sale or other disposition of all or substantially all of the Companys assets or distribution of property to shareholders (other than distributions payable out of earnings or retained earnings), or reclassification, change or conversion of the outstanding securities of the Company or of any reorganization of the Company (or any other corporation the stock or securities of which are at the time receivable upon the conversion of this Note) or any similar corporate reorganization on or after the date hereof, then and in each such case the Holder of this Note, upon the conversion hereof at any time thereafter shall be entitled to receive, in lieu of the stock or other securities and property receivable upon the conversion hereof prior to such consolidation, merger, sale or other disposition, reclassification, change, conversion or reorganization, the stock or other securities or property to which such Holder would have been entitled upon such consummation if such Holder had converted this Note immediately prior thereto. (iii)Adjustments for Issuance of Additional Shares of Common Stock. (A) In the event the Company, shall, at any time, from time to time, issue or sell any additional shares of Common Stock (other than pursuant to Common Stock Equivalents (hereafter defined) granted or issued prior to the issuance date of this Note) (Additional Shares of Common Stock), at a price per share less than the Conversion Price then in effect or without consideration, then the Conversion Price upon each such issuance shall be adjusted to that price (rounded to the nearest cent) determined by multiplying the Conversion Price then in effect by a fraction: 3 (1) the numerator of which shall be equal to the sum of (x) the number of shares of Common Stock outstanding immediately prior to the issuance of such Additional Shares of Common Stock plus (y) the number of shares of Common Stock (rounded to the nearest whole share) which the aggregate consideration for the total number of such Additional Shares of Common Stock so issued would purchase at a price per share equal to the Conversion Price then in effect, and (2) the denominator of which shall be equal to the number of shares of Common Stock outstanding immediately after the issuance of such Additional Shares of Common Stock. (B) The provisions of paragraph (A) of Section 5(iii) shall not apply to any issuance of Additional Shares of Common Stock for which an adjustment is provided elsewhere in this Section 5). No adjustment of the number of Shares for which this Note shall be convertible shall be made under this clause (iii) upon the issuance of any Additional Shares of Common Stock which are issued pursuant to the exercise of any Common Stock Equivalents, if any such adjustment shall previously have been made upon the issuance of such Common Stock Equivalents pursuant to the other provisions of this Section 5. (C)Issuance of Common Stock Equivalents. The provisions of this Section 5(iii) shall apply if (a) the Company, at any time after the issuance date of this Note, shall issue any securities convertible into or exchangeable for, directly or indirectly, Common Stock (Convertible Securities), other than the Convertible Notes, or (b) any rights or warrants or options to purchase any such Common Stock or Convertible Securities (collectively, the Common Stock Equivalents) shall be issued or sold. If the price per share for which Additional Shares of Common Stock may be issuable pursuant to any such Common Stock Equivalent shall be less than the applicable Conversion Price then in effect, or if, after any such issuance of Common Stock Equivalents, the price per share for which Additional Shares of Common Stock may be issuable thereafter is amended or adjusted, and such price as so amended shall be less than the applicable Conversion Price in effect at the time of such amendment or adjustment, then the applicable Conversion Price upon each such issuance or amendment shall be adjusted as provided in the first sentence of subsection (iii)(A) of this Section 5. No adjustment shall be made to the Conversion Price upon the issuance of Common Stock pursuant to the exercise, conversion or exchange of any Convertible Security or Common Stock Equivalent where an adjustment to the Conversion Price was made as a result of the issuance or purchase of any Convertible Security or Common Stock Equivalent. 4 (D)Certain Issues Excepted. Anything herein to the contrary notwithstanding, the Company shall not be required to make any adjustment to the Conversion Price under this Section 5 in connection with securities of the Company issued: (i) in connection with a merger, acquisition or consolidation, (ii) in connection with bona fide joint venture, strategic license or similar business partnering arrangements (provided that the transaction or arrangement is not primarily for the purpose of raising capital from Person whose primary business is investing in securities), (iii) upon exercise of the Warrants issued together with the Notes; (iv) upon exercise any warrants issued to the placement agents and its designees for the transactions contemplated hereby; and (v) in connection with any share split, share dividend, recapitalization or similar transaction by the Company for which adjustment is made pursuant to this Section 5. (E)Floor Price. Notwithstanding any provision of this Note to the contrary, no adjustment pursuant to Section 5(c)(iii) shall cause the Conversion Price to be less than $1.00, as adjusted for any stock dividend, stock split, stock combination, reclassification or similar transaction. (e)Elimination of Fractional Interests. No fractional shares of Common Stock shall be issued upon conversion of this Note, nor shall the Company be required to pay cash in lieu of fractional interests, it being the intent of the parties that all fractional interests shall be eliminated and that all issuances of Common Stock shall be rounded up to the nearest whole share.", "section_full_title": "5.Conversion", "document_id": "11i1Ws6jtKlAc0YkWRqMEr.", "section_title": "Conversion"}, {"text": " In the event that any of the following (each, an Event of Default) shall occur: (a)Non-Payment The Company shall default in the payment of the principal of, or accrued interest on, this Note as and when the same shall become due and payable, whether by acceleration or otherwise; or (b)Default in Covenants The Company shall default in any material manner in the observance or performance of the affirmative or negative covenants or agreements set forth in the SPA, this Note or that certain Registration Rights Agreement, dated of even date herewith, between the Holder and the Company (collectively, the Transaction Documents); or (c)Breach of Representations and Warranties The Company materially breaches any representation or warranty contained in the Transaction Documents; or (d)Exchange Act or Exchange Requirements Any termination of registration or suspension of the Companys reporting obligations under the Exchange Act or suspension from trading on the OTCBB (or any exchange on which the Common Stock is traded or listed for quotation (it being agreed that the delisting of the Common Stock from any national exchange shall not be an Event of Default if the Common Stock is, within ten (10) Business Days of the effective date of such delisting, quoted on the OTCBB), or the Companys failure to file reports with the SEC on a timely basis as required by the Exchange Act; or 5 (e)Judgments. (f)Nationalization. The confiscation, expropriation or nationalization by any governmental authority to which the Company or a Subsidiary is subject of any material property or assets of the Company or its Subsidiaries, taken as a whole (it being agreed, however, that it shall not be an Event of Default if the PRC government or any local instrumentality thereof shall require that Bohai or its Affiliates move its principal venue of operations to a different location within the PRC (a Principal Venue Move); or (g)Illegality of Notes Any court of competent jurisdiction issues an order declaring the Notes or any provision thereunder to be illegal; or (h)Cross Default There occurs with respect to any agreement, indenture or instrument under which the Company has Indebtedness of $5,000,000 or more in the aggregate: (i) a default with respect to any payment obligation thereunder that then entitles the holder thereof to declare such Indebtedness to be due and payable prior to its stated maturity, or (ii) any other default thereunder that entitles, and has caused, the holder thereof to declare such indebtedness to be due and payable prior to its stated maturity; or (i)Bankruptcy The Company shall: (i) admit in writing its inability to pay its debts as they become due; (ii) apply for, consent to, or acquiesce in, the appointment of a trustee, receiver, sequestrator or other custodian for the Company or any of its property, or make a general assignment for the benefit of creditors; (iii) in the absence of such application, consent or acquiesce in, permit or suffer to exist the appointment of a trustee, receiver, sequestrator or other custodian for the Company or for any part of its property; or (iv) permit or suffer to exist the commencement of any bankruptcy, reorganization, debt arrangement or other case or proceeding under any bankruptcy or insolvency law, or any dissolution, winding up or liquidation proceeding, in respect of the Company, and, if such case or proceeding is not commenced by the Company or converted to a voluntary case, such case or proceeding shall be consented to or acquiesced in by the Company or shall result in the entry of an order for relief; then, and so long as such Event of Default is continuing for a period of two (2)Business Days in the case of non-payment under Section 6(a), a period of five (5) Business Days in the case of a cross-default under 6(h), or for a period of thirty (30) calendar days in the case of events under Sections 6(b) through 6(g) (and the event which would constitute such Event of Default, if curable, has not been cured), by written notice to the Company from the Investor Representative, all obligations of the Company under this Note shall be immediately due and payable without presentment, demand, protest or any other action nor obligation of the Holder of any kind, all of which are hereby expressly waived, and Holder may exercise any other remedies the Holder may have at law or in equity. If an Event of Default specified in Section 6(i) above occurs, the principal of, and accrued interest on, all the Notes shall automatically, and without any declaration or other action on the part of any Holder, become immediately due and payable. 6 In addition, upon an Event of Default, and provided this Note is still outstanding, the Holder (through the Investor Representative) shall have the rights to receive its pro rata portion of 1,000,000 shares of Common Stock being held in escrow pursuant to the terms and conditions of that certain Securities Escrow Agreement between Glory Period Limited, the Investor Representative and Escrow, LLC, as escrow agent..", "section_full_title": "6.Events of Default", "document_id": "11i1Ws6jtKlAc0YkWRqMEr.", "section_title": "Events of Default"}, {"text": " The Company hereby agrees that, so long as the Note remains outstanding and unpaid, or any other amount is owing to the Holder hereunder, the Company will: (a)Corporate Existence and Qualification Take the necessary steps to preserve its corporate existence and its right to conduct business in all states in which the nature of its business requires qualification to do business; (b)Books of Account Keep its books of account in accordance with good accounting practices; (c)Insurance Maintain insurance with responsible and reputable insurance companies or associations, as determined by the Company in its sole but reasonable discretion, in such amounts and covering such risks as is usually carried by companies engaged in similar businesses and owning similar properties in the same general areas in which the Company operates; (d)Compliance with Law Comply with the charter and bylaws or other organizational or governing documents of the Company, and any law, treaty, rule or regulation, or determination of an arbitrator or a court or other governmental authority, in each case applicable to or binding upon the Company or any of its property or to which each the Company or any of its property is subject; (e)Taxes Duly pay and discharge all taxes or other claims, which might become a lien upon any of its property except to the extent that any thereof are being in good faith appropriately contested with adequate reserves provided therefore; (f)Reservation of Shares At all times have authorized, and reserved for the purpose of issuance, a sufficient number of shares of Common Stock and issuable upon conversion of this Note to provide for the issuance of all of the Shares. Prior to complete conversion of this Note, the Company shall not reduce the number of shares of Common Stock reserved for issuance hereunder without the written consent of the Holder except for a reduction proportionate to a reverse stock split effected for a business purpose other than affecting the requirements of this Section, which reverse stock split affects all shares of Common Stock equally; and (g)Use of Proceeds Use the proceeds of the Notes for the purposes described in the Memorandum. 7 (h)Notice of Known Events of Default The Company shall furnish to the Investor Representative a notice of any occurrence of an Event of Default, and what action the Company is taking or proposes to take with respect thereto, promptly after such Event of Default becomes known to the Company. (i)Further Assurances The Company shall execute and deliver any and all such further documents and take any and all such other actions as may be reasonably necessary or appropriate to carry out the intent and purposes of this Note and to consummate the transactions contemplated herein.", "section_full_title": "7.Affirmative Covenants of the Company", "document_id": "11i1Ws6jtKlAc0YkWRqMEr.", "section_title": "Affirmative Covenants of the Company"}, {"text": " Except for the transactions completed by the Share Exchange Agreement and all related documents between and among the Company and its Subsidiaries, and except as disclosed in the Memorandum, the Company hereby agrees that, so long as this Note remains outstanding and unpaid it will not, nor will it permit any of its Subsidiaries, without the consent of the Investor Representative, to: (a)Indebtedness for Borrowed Money Except as set forth on Schedule 8(a) hereto, incur, or permit to exist, any Indebtedness (as defined below) for borrowed money in excess of (i) US$10,000,000 during the twelve (12) month period beginning on the date hereof, or (ii) US$15,000,000 during period beginning on the date hereof and ending on the Maturity Date, except in the ordinary course of the Companys business.Forpurposes of this Section 8(a), Indebtedness shall mean: (i) all obligations of the Company for borrowed money or with respect to deposits or advances of any kind, (ii) all obligations of the Company evidenced by bonds, debentures, notes or other similar instruments, (iii) all obligations of the Company for the deferred purchase price of property or services, except current accounts payable arising in the ordinary course of business and not overdue beyond such period as is commercially reasonable for the Companys business, (iv) all obligations of the Company under conditional sale or other title retention agreements relating to property purchased by the Company, (v) all payment obligations of the Company with respect to interest rate or currency protection agreements, (vi) all obligations of the Company as an account party under any letter of credit or in respect of bankers acceptances, (vii) all obligations of any third party secured by property or assets of such Person (regardless of whether or not the Company is liable for repayment of such obligations), except for obligations to secure Indebtedness incurred within the limitations of this Section 8(a); (viii) all guarantees of the Company and (ix) the redemption price of all redeemable preferred stock of the Company, but only to the extent that such stock is redeemable at the option of the holder or requires sinking fund or similar payments at any time prior to the Maturity Date; (b)Loans; Investments Lend or advance money, credit or property to or invest in (by capital contribution, loan, purchase or otherwise) any Person in excess of US$2,000,000except: (i) investments in United States Government obligations, certificates of deposit of any banking institution with combined capital and surplus of at least $200,000,000; (ii) accounts receivable arising out of sales in the ordinary course of business; and (iii) inter-company loans between and among the Company and its Subsidiaries; 8 (c)Dividends and Distributions Pay dividends or make any other distribution on shares of the capital stock of the Company other than inter-company dividends, and distributions between and among the Company and its Subsidiaries; (d)Liens Except as set forth on Schedule 8(d) hereto, shall not create, assume or permit to exist, any lien on any of its property or assets now owned or hereafter acquired except (i) liens in favor of the Holder; (ii) liens granted to secure Indebtedness incurred within the limitations of Section 8(a) hereof; (iii) liens incidental to the conduct of its business or the ownership of its property and assets which were not incurred in connection with the borrowing of money or the obtaining of advances or credit and which do not materially impair the use thereof in the operation of its business; (iv) liens subordinate to the liens granted to secure this Note (v) liens for taxes or other governmental charges which are not delinquent or which are being contested in good faith and for which a reserve shall have been established in accordance with generally accepted accounting principles; and (vi) purchase money liens granted to secure the unpaid purchase price of any fixed assets purchased within the limitations of Section 8(g) hereof; (e)Contingent Liabilities Assume, endorse, be or become liable for or guarantee the obligations of any Person, contingently or otherwise, excluding however, the endorsement of negotiable instruments for deposit or collection in the ordinary course of business or guarantees of the Company made within the limitations of Section 8(a) hereof; (f)Sales of Receivables; Sale - Leasebacks Except as set forth on Schedule 8(f) hereto, sell, discount or otherwise dispose of notes, accounts receivable or other obligations owing to the Company, with or without recourse, except for the purpose of collection in the ordinary course of business; or sell any asset pursuant to an arrangement to thereafter lease such asset from the purchaser thereof; (g)Capital Expenditures; Capitalized Leases Except in the case of a Principal Venue Move, expend in the aggregate for the Company and all its Subsidiaries in excess of US$5,000,000 in any fiscal year for Capital Expenditures (as defined below), including payments made on account of Capitalized Leases (as defined below). For purposes of the foregoing, Capital Expenditures shall include payments made on account of any deferred purchase price or on account of any indebtedness incurred to finance any such purchase price. Capital Expenditures shall mean for any period, the aggregate amount of all payments made by any Person directly or indirectly for the purpose of acquiring, constructing or maintaining fixed assets, real property or equipment which, in accordance with generally accepted accounting principles, would be added as a debit to the fixed asset account of such Person, including, without limitation, all amounts paid or payable with respect to Capitalized Lease Obligations and interest which are required to be capitalized in accordance with generally accepted accounting principles. Capitalized Lease shall mean any lease the obligations to pay rent or other amounts under which constitute Capitalized Lease Obligations. Capitalized Lease Obligations shall mean as to any Person, the obligations of such Person to pay rent or other amounts under a lease of (or other agreement conveying the right to use) real and/or personal property which obligations are required to be classified and accounted for as a capital lease on a balance sheet of such Person under generally accepted accounting principles and, for purposes of this Note, the amount of such obligations shall be the capitalized amount thereof, determined in accordance with generally accepted accounting principles; 9 (h)Nature of Business Materially alter the nature of the Companys business or otherwise engage in any business other than the business engaged in or proposed to be engaged in on the date of this Note; (i)Stock of Subsidiaries Sell or otherwise dispose of any Subsidiary or permit a Subsidiary to issue any additional shares of its capital stock except pro rata to its stockholders; and (j)Accounting Changes Make, or permit any Subsidiary to make any change in their accounting treatment or financial reporting practices except as required or permitted by generally accepted accounting principles in effect from time to time. (k)Merger or Sale (i) The Company shall not, and shall not permit any of its Subsidiaries to, directly or indirectly, consolidate or merge with or into another Person (whether or not the Company or such Subsidiary is the surviving corporation), or sell, assign, transfer, convey or otherwise dispose of all or substantially all of the properties or assets of the Company and its Subsidiaries taken as a whole in one or more related transactions, to any other Person, unless (A) either the Company or such Subsidiary is the surviving corporation or the Person formed by or surviving any such consolidation or merger (if other than the Company or such Subsidiary) or to which such sale, assignment, transfer, conveyance or other disposition shall have been made is a corporation organized or existing under the laws of the United States, any state thereof or the District of Columbia, (B) the Person formed by or surviving any such consolidation or merger (if other than the Company or such Subsidiary) or the Person to which such sale, assignment, transfer, conveyance or other disposition shall have been made (1) assumes in writing all the obligations of the Company under the Notes and the other Transaction Documents and (2) causes to be delivered to each Holder of any Notes an opinion of nationally recognized independent counsel, or other independent counsel reasonably satisfactory to the Investor Representative, to the effect that all agreements or instruments effecting such assumption are enforceable in accordance with their terms and comply with the terms hereof, and (C) immediately after such transaction, no default or Event of Default exists. The foregoing paragraph in this Section 8(k)(i) shall not apply to (x) a merger of the Company with an Affiliate with no material assets, liabilities or operations solely for the purpose of reincorporating the Company in another jurisdiction; or (y) any consolidation or merger, or any sale, assignment, transfer, conveyance, lease or other disposition of assets between or among the Company and its Subsidiaries; provided, however, that such consolidation or merger shall comply with subclauses (A) and (B) in the foregoing paragraph. 10 (ii) Upon any consolidation or merger, or any sale, assignment, transfer, lease, conveyance or other disposition of all or substantially all of the assets of the Company or any of its Subsidiaries permitted by Section 8(k)(i) hereof, the successor corporation formed by such consolidation or into or with which the Company or such Subsidiary is merged or to which such sale, assignment, transfer, lease, conveyance or other disposition is made shall succeed to, and be substituted for (so that from and after the date of such consolidation, merger, sale, lease, conveyance or other disposition, the provisions of this Note referring to the Company, or to a Subsidiary shall refer instead to the successor corporation and not to the Company or such Subsidiary, as the case may be), may exercise every right and power of the Company or such Subsidiary under this Note with the same effect as if such successor Person had been named as the Company or a Subsidiary herein and shall be bound by every obligation and liability of the Company or such Subsidiary under this Note and the other Transaction Documents, however, that the predecessor Person shall not be relieved from the obligation to pay the principal of and interest on the Notes. (l)Transactions with Affiliates Except for transactions contemplated by the Transaction Documents or as otherwise approved by the Board (including a majority of the independent directors then on the Board) or as disclosed in the SEC Reports or the Memorandum, the Company shall not, and shall cause its Subsidiaries not to enter into any transaction with any director, officer, employee or holder of more than five percent of the outstanding capital stock of any class or series of capital stock of the Company or any Subsidiary, member of the family of any such person, or any corporation, partnership, trust or other entity in which any such person, or member of the family of any such person, is a director, officer, trustee, partner or holder of more than five percent of the outstanding capital stock thereof.", "section_full_title": "8.Negative Covenants of the Company", "document_id": "11i1Ws6jtKlAc0YkWRqMEr.", "section_title": "Negative Covenants of the Company"}, {"text": " No Holder, as such, of this Note shall be entitled to vote or receive dividends or be deemed the holder of shares of the Company for any purpose, nor shall anything contained in this Note be construed to confer upon the Holder hereof, as such, any of the rights at law of a stockholder of the Company prior to the issuance to the Holder of the shares of Common Stock which the Holder is then entitled to receive upon the due conversion of this Note.", "section_full_title": "9.Holder Not Deemed a Stockholder", "document_id": "11i1Ws6jtKlAc0YkWRqMEr.", "section_title": "Holder Not Deemed a Stockholder"}, {"text": " In case this Note shall become mutilated or defaced, or be destroyed, lost or stolen, the Company shall execute and deliver a new note of like principal amount in exchange and substitution for the mutilated or defaced Note, or in lieu of and in substitution for the destroyed, lost or stolen Note. In the case of a mutilated or defaced Note, the Holder shall surrender such Note to the Company. In the case of any destroyed, lost or stolen Note, the Holder shall furnish to the Company: (i) evidence to its satisfaction of the destruction, loss or theft of such Note and (ii) such security or indemnity as may be reasonably required by the Company to hold the Company harmless.", "section_full_title": "10.Mutilated, Destroyed, Lost or Stolen Notes", "document_id": "11i1Ws6jtKlAc0YkWRqMEr.", "section_title": "Mutilated, Destroyed, Lost or Stolen Notes"}, {"text": " The Company agrees that, in the event of an Event of Default, to reimburse the Holder for all reasonable costs and expenses (including reasonable legal fees of one counsel) incurred in connection with the enforcement and collection of this Note. 11", "section_full_title": "11.Waiver of Demand, Presentment, etc.", "document_id": "11i1Ws6jtKlAc0YkWRqMEr.", "section_title": "Waiver of Demand, Presentment, etc."}, {"text": " All payments with respect to this Note shall be made in lawful money of the United States of America, at the address of the Holder as of the date hereof or as designated in writing by the Holder from time to time. The receipt by the Holderofimmediately availablefunds shall constitute a payment of principal and interest hereunder and shall satisfy and discharge the liability for principal and interest on this Note to the extent of the sum represented by such payment. Payment shall be credited first to the accrued interest then due and payable and the remainder applied to principal.", "section_full_title": "12.Payment", "document_id": "11i1Ws6jtKlAc0YkWRqMEr.", "section_title": "Payment"}, {"text": " The rights and obligations of the Company and the Holder of this Note shall be binding upon, and inure to the benefit of, the successors and permitted assigns of the parties hereto. The Holder may not assign, pledge or otherwise transfer this Note or any interest therein without the prior written consent of the Company. Interest and principal are payable only to the registered Holder of this Note on the books and records of the Company.", "section_full_title": "13.Assignment", "document_id": "11i1Ws6jtKlAc0YkWRqMEr.", "section_title": "Assignment"}, {"text": " Any provision of this Note, including, without limitation, the due date hereof, and the observance of any term hereof, may be amended, waived or modified (either generally or in a particular instance and either retroactively or prospectively) only with the written consent of the Company and the Investor Representative.", "section_full_title": "14.Waiver and Amendment", "document_id": "11i1Ws6jtKlAc0YkWRqMEr.", "section_title": "Waiver and Amendment"}, {"text": " Any notice, request or other communication required or permitted hereunder shall be in writing and shall be deemed to have been duly given if given in accordance with the provisions of Section 9.2 of the SPA.", "section_full_title": "15.Notices", "document_id": "11i1Ws6jtKlAc0YkWRqMEr.", "section_title": "Notices"}, {"text": " This Note shall be governed by and construed in accordance with the laws of the State of New York, USA, excluding that body of law relating to conflicts of laws.", "section_full_title": "16.Governing Law", "document_id": "11i1Ws6jtKlAc0YkWRqMEr.", "section_title": "Governing Law"}, {"text": " Each party agrees that all legal proceedings concerning the interpretations, enforcement and defense of the transactions contemplated by this Note (whether brought against a party hereto or its respective affiliates, directors, officers, shareholders, employees or agents) shall be commenced exclusively in the state and federal courts sitting in the City of New York. Each party hereto hereby irrevocably submits to the exclusive jurisdiction of the state and federal courts sitting in the City of New York, New York for the adjudication of any dispute hereunder or in connection herewith or with any transaction contemplated hereby or discussed herein (including with respect to the enforcement of this Note, and hereby irrevocably waives, and agrees not to assert in any suit, action or proceeding, any claim that it is not personally subject to the jurisdiction of any such court, that such suit, action or proceeding is improper. Each party hereto hereby irrevocably waives personal service of process and consents to process being served in any such suit, action or proceeding by mailing a copy thereof via registered or certified mail or overnight delivery (with evidence of delivery) to such party at the address in effect for notices to it under this Note and agrees that such service shall constitute good and sufficient service of process and notice thereof. Nothing contained herein shall be deemed to limit in any way any right to serve process in any manner permitted by law. THE COMPANY AND, BY ITS ACCEPTANCE HEREOF, THE HOLDER (INCLUDING THEIR RESPECTIVE AFFILIATES, AGENTS, OFFICERS, DIRECTORS AND EMPLOYEES) HEREBY IRREVOCABLY WAIVE, TO THE FULLEST EXTENT PERMITTED BY APPLICABLE LAW, ANY AND ALL RIGHT TO TRIAL BY JURY IN ANY LEGAL PROCEEDING ARISING OUT OF OR RELATING TO THIS NOTE OR THE TRANSACTIONS CONTEMPLATED HEREBY. 12", "section_full_title": "17.Consent to Jurisdiction", "document_id": "11i1Ws6jtKlAc0YkWRqMEr.", "section_title": "Consent to Jurisdiction"}, {"text": " If one or more provisions of this Note are held to be unenforceable under applicable law, such provisions shall be excluded from this Note, and the balance of this Note shall be interpreted as if such provisions were so excluded and shall be enforceable in accordance with its terms.", "section_full_title": "18.Severability", "document_id": "11i1Ws6jtKlAc0YkWRqMEr.", "section_title": "Severability"}, {"text": " Section headings in this Note are for convenience only, and shall not be used in the construction of this Note. [Signature Page Follows] 13 IN WITNESS WHEREOF, the Company has caused this Noteto be issued as of the date first above written. LINK RESOURCES, INC. By: Name: Title: 14 Exhibit A LINK RESOURCES, INC. NOTE CONVERSION NOTICE Reference is made to the 8% Senior Convertible Promissory Note in the original principal amount of $___________ of Link Resources, Inc., a Nevada corporation (the Company), issued to the undersigned (the Note). In accordance with and pursuant to the terms of the Note, the undersigned hereby elects to convert the entire outstanding principal amount due and owing under the Note, together with all accrued but unpaid interest thereon, into shares of Common Stock, $0.001 par value per share, of the Company (the Common Stock), by tendering the original of the Note for cancellation. Please confirm the following information: Principal Amount Outstanding under the Note: Accrued but unpaid interest under the Note: Conversion Price: Number of Shares to be issued: Please issue the Shares into which the Note is being converted in the following name and to the following address: Issue to: Address: Facsimile Number: Authorization: By: Title: Dated:", "section_full_title": "19.Headings", "document_id": "11i1Ws6jtKlAc0YkWRqMEr.", "section_title": "Headings"}, {"text": "  Orwell and Marketing agree that Marketing shall become the Asset Manager of Orwell for gas sales and GTS service related to Orwells Service Agreement #37962 with Columbia.", "section_full_title": "1.Asset Management Agreement.", "document_id": "11v4ot8xLBW5Zit2eDUuhB.", "section_title": "Asset Management Agreement."}, {"text": "  It is the express intention of Orwell and of Marketing to comply with all aspects of the rules, regulations and decisions of the Federal Energy Regulatory Commission (the FERC) regarding Asset Management Agreements that were in effect at the time of execution of this Addendum, or as such rules, regulations and decisions may be changed throughout the term of the AMA. Deviations from such rules, regulations and decisions of the FERC related to AMAs are due to mistake or inadvertence and not to intent. If an action occurs that results in a material deviation from the rules, regulations or decisions of the FERC, Orwell and Marketing pledge to make a good faith effort to rectify such deviations, when discovered by either or both of them. Material deviations that result in harm to competitive markets or harm to competitors will be reported to the Chief Compliance Officer of Orwell.", "section_full_title": "2.Regulatory Compliance.", "document_id": "11v4ot8xLBW5Zit2eDUuhB.", "section_title": "Regulatory Compliance."}, {"text": "  This AMA shall commence on January 4, 2010. The provisions of the AMA governing the release to Marketing of Orwells interstate pipeline Service Agreement #37962 and all revisions thereto with Columbia Gas Transmission Corporation (Columbia) may be terminated upon the mutual agreement of the Parties. Orwell agrees to consult in good faith with Marketing prior to the expiration of Service Agreement #37962 and to exercise Orwells right to roll over or extend the term of Service Agreement #37962 in the event that Marketing agrees to extend the term of this AMA for a period equal to the proposed life extension of Service Agreement #37962. At such time as Marketing desires to convert this asset management agreement into a long-term, permanent capacity release of Service Agreement #37962, Orwell agrees to enter into such long-term capacity release at the maximum rate cap applicable to Page 2 of 3 ASSET MANAGEMENT AGREEMENT Columbias GTS service. Orwell further agrees to use its best efforts to cause Columbia to substitute Marketing for Orwell on Service Agreement #37962.", "section_full_title": "3.Term of Contract.", "document_id": "11v4ot8xLBW5Zit2eDUuhB.", "section_title": "Term of Contract."}, {"text": "  Marketing agrees: (1) to assume all the rights and obligations specified in Service Agreement #37962, including payment of all costs related to such Service Agreement including but not limited to rates, fuel charges, authorized or unauthorized over-run charges, penalties or fees as are approved by the FERC for the GTS service; and (2) to hold Orwell harmless from the incurrence of all such Service Agreement costs. Marketing shall have the absolute right to receive any FERC ordered refunds or rebates allocated to Service Agreement #37962.", "section_full_title": "4.Pricing of Released Capacity.", "document_id": "11v4ot8xLBW5Zit2eDUuhB.", "section_title": "Pricing of Released Capacity."}, {"text": "  Orwell shall have the right to inject and withdraw one hundred percent of its daily contract demand if necessary to meet its firm capacity requirements. Notwithstanding the foregoing, Marketing agrees that Orwell may on any day during a minimum period of five months out of each twelve-month period of the release call upon Marketing to deliver to Orwell one-hundred percent of the daily contract demand for storage injections or withdrawals. The price of the natural gas so delivered shall be as specified in the GSA.", "section_full_title": "5.Express Conditions  Rights of Recall.", "document_id": "11v4ot8xLBW5Zit2eDUuhB.", "section_title": "Express Conditions  Rights of Recall."}, {"text": "  Marketing appoints Orwell to act as Marketings agent for the purpose of communicating this capacity release transaction for timely posting on Columbias internet website in accord with the rules and regulations of the FERC and Columbias tariff. Orwell agrees to act as Marketings agent for the purpose of this capacity release posting. Orwell agrees to appoint and/or authorize, and hereby appoints and authorizes, Marketing to act as Orwells Agent on Columbia in order for Marketing to engage in various activities in accordance with this AMA and the GSA . Specifically, Orwell authorizes Marketing to perform the following functions and/or access information concerning Marketings activity related to: the submission of nomination and associated activities, including but not limited to confirmation and scheduling; the submission of bids for released capacity; the offering of released capacity; invoicing, including but not limited to the receipt and viewing of invoices and being responsible for payments. Further, Marketing agrees to act as Orwells Agent on Columbia in order for Marketing, on Orwells behalf, to engage in various activities in accordance with the AMA and the sale of natural gas pursuant from Marketing to Orwell. Specifically, Marketing is authorized to perform the following functions and/or access information concerning Orwells activities related to: the submission of nominations and associated activities, including but not limited to confirmation and scheduled volumes; the receipt of third party imbalance statements; the execution of imbalance trades; the submission of bids for released capacity; the offering of released capacity; and invoicing, including but not limited to the receipt and viewing of invoices and being responsible for payments. Page 3 of 3 ASSET MANAGEMENT AGREEMENT Marketing and Orwell each agree to execute the appropriate form(s) and provide the appropriate notice required by Columbia for the designation of an Agent.", "section_full_title": "6.Appointment of Agent on Columbia.", "document_id": "11v4ot8xLBW5Zit2eDUuhB.", "section_title": "Appointment of Agent on Columbia."}, {"text": "  Marketing shall act as Orwells agent as described above for Service Agreement #37962 until this AMA is terminated by either party pursuant to the terms of this AMA. Upon termination, Marketing and Orwell agree to execute the appropriate form(s) and provide appropriate notice to Columbia to terminate or remove the agency authorization(s). THEREFORE, Marketing agrees to become the Asset Manager and Agent of Orwell as described above, and Orwell agrees to enter into a pre-arranged capacity release of the interstate pipeline capacity in #37962, subject to Orwells rights of recall as specified above, which are not to be diminished by any provisions of the GSA. IN WITNESS WHEREOF, the Parties have executed this Asset Management Agreement. This AMA may be executed in counterparts, an original of each signed AMA to be delivered to the counterpart. Asset Manager: John D. Oil and Gas Marketing Company, LLC /s/ Richard M. Osborne Richard M. Osborne Chief Executive Officer Date: January 3, 2010 Capacity Releaser: Orwell Natural Gas Company /s/ Thomas J. Smith Thomas J. Smith President Date: January 3, 2010", "section_full_title": "7.Termination of Agency Agreements.", "document_id": "11v4ot8xLBW5Zit2eDUuhB.", "section_title": "Termination of Agency Agreements."}, {"text": " A Contingent Owner may be designated.", "section_full_title": "1.The Owner must be the Annuitant", "document_id": "138kv7WztDqEdjsN6r5LfJ.", "section_title": "The Owner must be the Annuitant"}, {"text": " If the Owners entire interest is to be distributed in other than a lump sum, then the amount to be distributed each year (commencing with the required beginning date and each year thereafter) must be at least an amount equal to the quotient obtained by dividing the Owners entire interest by the life expectancy of the Owner or joint and last survivor expectancy of the Owner and designated beneficiary, in accordance with Code Section 403(b)(10). Life expectancy and joint and last survivor expectancy are computed in accordance with Code Section 403(b)(10), by use of the return multiples contained in Tables V and VI of section 1/72-9 of the Income Tax Regulations. For purposes of this computation, the Owners life expectancy and, if applicable, the Owners spouses life expectancy may be recalculated no more frequently than annually; however, the life expectancy of a nonspouse beneficiary may not be recalculated.", "section_full_title": "5.Minimum Amounts to be distributed", "document_id": "138kv7WztDqEdjsN6r5LfJ.", "section_title": "Minimum Amounts to be distributed"}, {"text": " The Company is offering for sale to the Subscriber, and the Subscriber is offering to purchase from the Company, Units at the Unit Price determined to be $______ per Unit on the date hereof (the Offering), subject to the terms, conditions, acknowledgements, representations, and warranties stated herein and in the Share Issuance Agreement. Each Unit consists of one (1) share of common stock of the Company (Share) and one (1) warrant representing the right to purchase one full Share (Warrant). Each Warrant is exercisable for a period of two (2) years at an exercise price equal to 175% of the Unit Price on the date hereof, or $_______ per Share.", "section_full_title": "1.Offering", "document_id": "14tsEF5dHpm8B2kKm0TbpP.", "section_title": "Offering"}, {"text": " The Subscriber hereby irrevocably subscribes to purchase from the Company the number of Units and at the aggregate purchase price (the Purchase Price) set forth on the execution page to this Subscription Agreement titled SUBSCRIPTION AGREEMENT SIGNATURE PAGE.", "section_full_title": "2.Subscription", "document_id": "14tsEF5dHpm8B2kKm0TbpP.", "section_title": "Subscription"}, {"text": " The Subscriber shall have tendered and delivered an Advance to the Company in the amount representing the Purchase Price set forth on the Subscription Agreement Signature Page, along with the execution and delivery of this Subscription Agreement. 1", "section_full_title": "3.Purchase", "document_id": "14tsEF5dHpm8B2kKm0TbpP.", "section_title": "Purchase"}, {"text": " The Subscriber understands and agrees that the Company reserves the right, in its sole discretion, to reject this subscription, in whole or in part if the Subscriber (a) failed to deliver the Advance as payment of the Purchase Price, (b) failed to deliver a completed Subscription Agreement, or (c) constitutes a U.S. Person as such term is defined in Rule 902(k) of Regulation S under the Securities Act of 1933, as amended (the Act), until there has been notice of acceptance of the Subscribers subscription. In the event of rejection of this subscription, the Company and Subscriber shall take all actions deemed necessary or advisable to remedy such disqualifying matter causing rejection of the subscription. Upon acceptance of the subscription by the Company, the Company will deliver to the Subscriber an accepted Subscription Agreement, and cause the Units to be promptly issued to the Subscriber.", "section_full_title": "4.Acceptance or Rejection of Subscription", "document_id": "14tsEF5dHpm8B2kKm0TbpP.", "section_title": "Acceptance or Rejection of Subscription"}, {"text": " The Subscriber hereby represents, warrants and covenants to the Company as follows, realizing that the Company intends to rely on these representations, warranties, and covenants, which shall survive the acceptance of the Subscribers subscription by the Company: 5.1Purchase For Own Account The Subscriber (a) is purchasing the Units, or Shares underlying the Warrants (the Units, Shares, Warrants and Shares underlying the Warrants are collectively referred to hereafter as the Securities) for its own benefit and account (not as a nominee or agent) for investment purposes only and not with an intent or view to, or for, resale, distribution or fractionalization thereof, in whole or in part, (b) has no present arrangement or intention to sell or distribute the Securities, or to grant participation in the Securities, and (c) does not have any contract, undertaking, agreement or arrangement with any person to sell, transfer or grant participation to such person, or to any third person, with respect to any of the Securities. 5.2Speculative Investment The Subscriber represents and warrants that it understands that an investment in the Securities is speculative and involves substantial risks, including the possible loss of the entire investment, and Subscriber represents and warrants that it is in a position to lose the entire amount of such investment. In order to understand the risks involved with such investment, Subscriber represents and warrants that it has carefully read and understood the Disclosure Documents and Risk Factors set forth in Section 6 of this Subscription Agreement. 5.3Independent Review In making the decision to invest in the Company and subscribe for Units, the Subscriber has (a) received, read and is familiar with the Subscription Agreement, Shares Issuance Agreement andReports (b) been given access and the opportunity to ask any and all questions it had, and to receive answers from the Company or any person acting on its behalf concerning the Company, its business plan, management and current financial condition, and/or the terms and conditions of the offer and sale of the Units, and Subscriber has received complete and satisfactory answers to any such inquiries, (c) has relied solely upon the information contained within this Subscription Agreement or upon information obtained in its own investigation, and represents and warrants that neither the Company, nor any officer, employee, agent, or affiliate of the Company has made any representations other than those contained within this Subscription Agreement, (d) understands that the attorneys, accountants or other professionals who have been employed to perform services on the Companys behalf have NOT been employed to represent the interests of the Subscriber, and understands that it should consult with and rely on its own counsel or advisors for independent legal, accounting, financial and tax advice concerning this investment in the Company, including but not limited to advice as to the legality of any resale of the Securities, tax or other consequences of such investment in the Company, and the suitability of the investment for the Subscriber, and (e) acknowledges that the Reports have been accessible and available for inspection and that the appropriate officers of the Company have been available to answer any questions concerning this investment. The Subscriber represents and warrants it is solely responsible for its own due diligence investigation of the Company and its analysis of the merits and risks of an investment in the Company. 2 5.4Pre-existing Relationship with the Company or Sufficient Business and Financial Experience The Subscriber represents and warrants that: (i) it has a preexisting personal or business relationship with the Company or any of the Companys officers, directors or controlling persons, or (ii) by reason of its business or financial experience or the business or financial experience of its professional advisors who are unaffiliated with and who are not compensated by the Company or any affiliate or selling agent of the Company, directly or indirectly, it could be reasonably assumed to have the capacity to protect its own interests in connection with the purchase of the Securities. A preexisting personal or business relationship will be deemed to exist where the Subscriber has personal or business contacts with the Company, or any officer, director or controlling person of the Company, of such a nature and duration that would enable a reasonably prudent purchaser to be aware of the character, business acumen and general business and financial circumstances of the Company or person with whom such relationship exists. 5.5No Advertisement or General Solicitation The offer and sale of the Units has not been advertised through any article, notice or other communication published in any newspaper, magazine, or similar media or broadcast over television or radio, or through any seminar or meeting whose attendees have been invited by any general solicitation or general advertising, and the Subscriber is not purchasing as a result of any such advertisement or solicitation. 5.6Authority to Purchase the Units and to Execute Subscription Agreement. The Subscriber hereby adopts, accepts and agrees to be bound by all the terms and provisions of this Subscription Agreement, and, if this subscription is accepted in whole or in part, to perform and comply with any obligations therein imposed. 5.7Partnership, Corporation or Trust If the Subscriber is a partnership, corporation or trust, the person executing this Subscription Agreement on its behalf represents and warrants that (i) it has made due inquiry to determine the truthfulness of the representations and warranties made pursuant to this Subscription Agreement, and (ii) it is duly empowered, authorized, and qualified (and if the Subscriber is a trust, by the trust agreement) to make this investment and to enter into and execute this Subscription Agreement on behalf of such entity. 5.8Restricted Securities The Subscriber acknowledges that the Securities have not been registered or qualified under any federal or state securities laws in reliance upon exemptions from the registration requirements of such laws, and the Securities may not be transferred by the undersigned except in compliance with the registration requirements of such laws or pursuant to available exemptions from registration. The offer and sale of the Securities has not been approved or disapproved by the SEC or any state regulatory authority, and any representation to the contrary is unlawful. 5.9Legend The Subscriber understands and agrees that the certificate(s) or the documents representing the Securities will bear one or more restrictive legends determined by counsel to the Company to be necessary or appropriate in order to comply with United States federal or state securities law or to secure or protect any applicable exemptions from registration or qualification, including a legend in substantially the following form and the Subscriber agrees to abide by the terms thereof: 3 THE SECURITIES REPRESENTED HEREBY HAVE NOT BEEN REGISTERED UNDER THE SECURITIES ACT OF 1933, AS AMENDED (THE ACT) OR ANY OTHER APPLICABLE SECURITIES LAW OF ANY STATE OR OTHER JURISDICTION, AND HAVE BEEN ISSUED IN RELIANCE UPON AN EXEMPTION FROM THE REGISTRATION REQUIREMENTS OF THE ACT PROVIDED BY REGULATION S PROMULGATED UNDER THE ACT. THESE SECURITIES CANNOT BE TRANSFERRED, OFFERED, OR SOLD IN THE UNITED STATES OR TO A U.S. PERSON (AS THAT TERM IS DEFINED IN REGULATION S PROMULGATED UNDER THE ACT) UNLESS SUCH SECURITIES ARE REGISTERED UNDER THE ACT OR AN EXEMPTION FROM REGISTRATION IS AVAILABLE, THE AVAILABILITY OF WHICH IS TO BE ESTABLISHED TO THE SATISFACTION OF THE CORPORATION AND ITS COUNSEL. HEDGING TRANSACTIONS INVOLVING THE SECURITIES MAY NOT BE CONDUCTED UNLESS IN COMPLIANCE WITH THE ACT. 5.10Compliance with Securities Law The Subscriber will not sell or otherwise transfer the Securities except as permitted under the Act and applicable United States state securities laws or an exemption therefrom, provided that the Subscriber delivers to the Company an opinion of counsel (which opinion and counsel are satisfactory to the Company) confirming the availability of such exemption upon the Companys request. 5.11Resale Subscriber may resell the Securities hereunder only pursuant to registration under the Act, or pursuant to an available exemption from registration and subject to an available exemption under Rule 144 promulgated under the Act (Rule 144). The Securities may be sold following six (6) months from the date Subscriber purchases the Securities so long as the Subscriber is not an affiliate of the Company and all the conditions set forth under Rule 144 have been satisfied. 5.12Companys Reliance on Information Provided The Subscriber understands that the Securities are being offered and sold to it in reliance on specific exemptions from the registration requirements of the United States federal and state securities laws and that the Company is relying upon the truth and accuracy of the representations, warranties, agreements, acknowledgments and understandings of the Subscriber set forth herein to determine the applicability of such exemptions and the suitability of the Subscriber to acquire the Securities. 5.13Not a U. The Subscriber represents and warrants that it is not a U.S. person as such term is defined in Rule 902(k) of Regulation S under the Act. A definition of U.S. person includes but is not limited to the following: (i) any natural person resident of the U.S.; (ii) any partnership or corporation organized or incorporated under the laws of the U.S.; (iii) any estate of which any executor or administrator is a U.S. person; and (iv) any partnership or corporation if (1) organized or incorporated under the laws of any foreign jurisdiction, and (2) formed by a U.S. person principally for the purpose of investing in securities not registered under the Act, unless it is organized or incorporated, and owned, by accredited investors who are not natural persons, estates or trusts. The Subscriber represents that it is a bona fide resident of, and is domiciled in, the country so designated on the signature page hereto. 5.14No Written or Oral Representations No person or entity, including the Company or agents of the Company, has made any written or oral representations or warranties, expressly or by implication to the Subscriber, (a) that any person will resell or repurchase the Securities, (b) that any person will refund the Purchase Price for the Units, (c) as to the future price or value of the Securities, (d) as to the appropriate or exact length of time that Subscriber will be required to hold the Securities, (e) as to the percentage of profit and/or amount or type of consideration, profit, or loss to be realized, if any, as a result of an investment in the Securities, or (f) as to the amount of distributions that the Company will make. 4 5.15Subscription Rejection Right The Subscriber acknowledges that the Company reserves the right to reject its subscription, to accept any subscription in part only, or to prorate subscriptions, if the Subscriber (a) fails to deliver the Advance as payment of the Purchase Price, (b) fails to deliver a completed Subscription Agreement, or (c) constitutes a U.S. Person as such term is defined in Rule 902(k) of Regulation S under the Act. 5.16Subsequent Changes All information which the Subscriber has provided to the Company, including but not limited to all information given herein concerning itself, investor status, address, residence, financial position and knowledge and experience of financial and business matters are correct and complete as of the date of the execution of the Subscription Agreement, and that if there should be any material change in such information prior to this Subscription Agreement being accepted by the Company, the Subscriber will immediately provide the Company with such information. The Subscriber will promptly notify the Company of any material fact or circumstance that would cause any of the foregoing representations to be untrue, incomplete, or misleading.", "section_full_title": "5.Subscribers Representations, Warranties, Covenants", "document_id": "14tsEF5dHpm8B2kKm0TbpP.", "section_title": "Subscribers Representations, Warranties, Covenants"}, {"text": " 6.1Speculative. The Subscriber understands that an investment in the Securities is speculative and involves substantial risks, including the possible loss of the entire investment, and understands the risks and uncertainties discussed in this Subscription Agreement. 6.2Investment Risk; No Operating History. The Subscriber understands that the Company is currently in a development stage and has no operating history nor any history of profitability. The Company reserves the right to obtain additional capital to develop its operations and complete its business plans. There is no assurance that the Company can obtain additional capital to accomplish the foregoing or successfully complete its business plans. As such, the Subscribers investment in the Company involves a high degree of risk which may result in a loss of all or substantially all of the Subscribers investment. 6.3No Review of Fairness. No federal or state agency has passed upon the Securities nor has made any finding, recommendation or determination as to the fairness of this investment. 6.4No Representations Concerning Suitability. The Company has made no representations or recommendations to the Subscriber concerning whether the purchase of the Securities is a suitable investment for it. The Subscriber and its representative, if any, have the sole responsibility for determining whether this investment is suitable for the Subscriber. The Company is not responsible to the Subscriber for making any such determination. 6.5Unit Price May Fluctuate. In accordance with the Shares Issuance Agreement, the Unit Price and the exercise price of the Warrants may fluctuate from time to time based upon market conditions and trading activity of the Companys Common Stock. 6.6Illiquid Investment. The Subscribers investment in the Company is an illiquid investment, and the Subscriber must bear the economic risk of its investment. 5 6.7The Securities Are Not Registered With The SEC Nor With Any State Securities Authorities.The Securities will not be registered under the Act nor under any state securities laws nor the securities laws of any other country in reliance upon specific exemptions from registration under the provisions of the Act and applicable state securities laws and the laws of other countries. The Securities issued will be deemed \"restricted securities\" and may not be sold, transferred or otherwise disposed of without an effective registration statement under the Act or an exemption therefrom. As a result, the Securities may be transferred or resold only if the Securities have been registered or there is an available exemption from registration and the certificates representing the Securities will bear a legend to this effect. The Securities are being offered in reliance upon an exemption from the registration provisions of the Act, pursuant to Regulation S promulgated thereunder. 6.8Dilution in Initial Equity Interest. Any further issuance by the Company of any additional Securities of the Company will dilute any equity interest of the Subscriber. No assurances can be given that the Company will not issue additional securities that will have the effect of diluting the equity interest of the Subscriber. 6.9Due Diligence and Investigation. The offer and sale of the Units is not underwritten by or being offered through investment bankers or underwriters. There has not been an independent review of matters covered in the Subscription Agreement by any such professionals or other professionals. Subscriber must rely solely upon its own investigation and analysis of the risks in making this investment decision. 6.10No Established Public Trading Market. Even though the Companys Common Stock is traded over-the-counter by quotation on the OTC Bulletin Board under the symbol AMNP the Subscriber realizes there is no established public trading market for the Securities. 6.11Penny Stock Regulations Affect the Companys Stock Price, Which May Make it More Difficult to Sell.Broker-dealer practices in connection with transactions in penny stocks are regulated by certain penny stock rules adopted by the SEC. Penny stocks generally are equity securities with a price per share of less than $5.00 (other than securities registered on certain national securities exchanges or quoted on the NASDAQ Stock Market, provided that current price and volume information with respect to transactions in such securities is provided by the exchange or system). The penny stock rules require a broker-dealer, prior to a transaction in a penny stock not otherwise exempt from the rules, to deliver a standardized risk disclosure document that provides information about penny stocks and the risks in the penny stock market. The broker-dealer must also provide the customer with current bid and offer quotations for the penny stock, the compensation of the broker-dealer and its salesperson in the transaction, and monthly account statements showing the market value of each penny stock held in the customers account. In addition, the penny stock rules generally require that prior to a transaction in a penny stock the broker-dealer make a special written determination that the penny stock is a suitable investment for the purchaser and receive the purchasers written agreement to the transaction. These disclosure requirements may have the effect of reducing the level of trading activity in the secondary market for a stock that becomes subject to the penny stock rules. The Securities are subject to the penny stock rules, and investors may find it more difficult to sell their securities. 6", "section_full_title": "6.Risk Factors.", "document_id": "14tsEF5dHpm8B2kKm0TbpP.", "section_title": "Risk Factors."}, {"text": " The Subscriber agrees to indemnify and hold the Company and any person, if any, who controls the Company, within the meaning of Section 15 of the Act, and the Companys officers, directors, agents, attorneys, and affiliates harmless from and against all damages, losses, costs and expenses, including reasonable attorneys fees and expenses reasonably incurred in the investigation or preparation in defense of any litigation commenced or threatened or any claim whatsoever, which they may incur by reason of the failure by the Subscriber to comply with the terms and conditions of this Subscription Agreement, or by reason of any misrepresentation or breach of any warranty or covenant made by the Subscriber herein, or in any document provided by the Subscriber to the Company in connection with the Subscribers investment in the Securities. The Subscriber further agrees that the provisions of this Section shall survive (a) the sale, transfer or any attempted sale or transfer of all or a portion of the Securities, and (b) the death of the Subscriber.", "section_full_title": "7.Indemnification", "document_id": "14tsEF5dHpm8B2kKm0TbpP.", "section_title": "Indemnification"}, {"text": " The Subscriber agrees that it may not cancel, terminate, or revoke this Subscription Agreement or any agreement made by it hereunder and that this Subscription Agreement shall survive the death or disability of the Subscriber and shall be binding upon the Subscribers heirs, executors, administrators, successors, and assigns, who shall execute a substantially similar agreement.", "section_full_title": "8.Termination, Cancellation or Revocation", "document_id": "14tsEF5dHpm8B2kKm0TbpP.", "section_title": "Termination, Cancellation or Revocation"}, {"text": " Neither this Subscription Agreement nor any provisions hereof shall be modified, discharged or terminated except by an instrument in writing signed by the party against whom any modification, discharge or termination is sought.", "section_full_title": "9.Modification", "document_id": "14tsEF5dHpm8B2kKm0TbpP.", "section_title": "Modification"}, {"text": " Any notice, demand or other communication that any party hereto may be required, or may elect, to give to anyone interested hereunder shall be deemed given (a) three (3) business days after mailing if sent by registered or certified mail, return receipt requested, addressed to such address as may be given herein, (b) immediately if delivered personally at such address, including by overnight delivery service, or (c) immediately if communicated by facsimile to the person entitled to such notice, provided, however, that acknowledgment of the receipt of such facsimile notice is returned to the person giving notice, it being understood that such acknowledgment shall not be unreasonably withheld.", "section_full_title": "10.Notices", "document_id": "14tsEF5dHpm8B2kKm0TbpP.", "section_title": "Notices"}, {"text": " Subject to the provisions of this Subscription Agreement, the Company, on the one hand, and the Subscriber, on the other hand, will pay all fees and expenses (including, without limitation, legal fees and expenses) incurred by them in connection with the transactions contemplated hereunder.", "section_full_title": "11.Payment of Expenses", "document_id": "14tsEF5dHpm8B2kKm0TbpP.", "section_title": "Payment of Expenses"}, {"text": " This Subscription Agreement may be executed through the use of separate signature pages (including by facsimile) or in any number of counterparts, and each of such counterparts shall, for all purposes, constitute one agreement binding on all the parties, notwithstanding that all parties are not signatories to the same counterpart.", "section_full_title": "12.Counterparts", "document_id": "14tsEF5dHpm8B2kKm0TbpP.", "section_title": "Counterparts"}, {"text": " Except as otherwise provided herein, this Subscription Agreement shall be binding upon and inure to the benefit of the parties and their heirs, executors, administrators, successors, legal representatives and assigns. The obligation of the Subscriber and the agreements, representations, warranties and acknowledgments herein contained shall be deemed to be made by and be binding upon the Subscriber and the heirs, executors, administrators and successors of the Subscriber.", "section_full_title": "13.Binding Effect", "document_id": "14tsEF5dHpm8B2kKm0TbpP.", "section_title": "Binding Effect"}, {"text": " This instrument, including all appendices, exhibits and schedules attached hereto which have been incorporated by reference into this Subscription Agreement, contain the entire agreement of the parties with respect to the subject matter of this Subscription Agreement, and there are no representations, covenants or other agreements except as stated or referred to herein.", "section_full_title": "14.Entire Agreement", "document_id": "14tsEF5dHpm8B2kKm0TbpP.", "section_title": "Entire Agreement"}, {"text": " This Subscription Agreement is not transferable or assignable by the Subscriber except as provided herein. 7", "section_full_title": "15.Assignability", "document_id": "14tsEF5dHpm8B2kKm0TbpP.", "section_title": "Assignability"}, {"text": " This Subscription Agreement shall be governed by and construed in accordance with the laws of the State of Nevada as applied to residents of that state entering into contracts wholly to be performed in that state, without regards to conflicts of laws principles. The Subscriber hereby agrees that any suit, action, or proceeding arising out of or relating to this Subscription Agreement, any amendments or any replacements hereof, and any transactions or agreements relating hereto shall be brought in the courts of, or the Federal courts in, the State of Nevada, County of Washoe, and the Subscriber hereby irrevocably consents and submits to the jurisdiction of such courts for the purposes of any such suit, action or proceeding, and the Subscriber agrees that service of process on the Subscriber in such suit, action or proceeding may be made in the same way as is prescribed by this Subscription Agreement for other notices. The Subscriber hereby waives, and agrees not to assert against the Company or any assignee thereof, by way of motion, as a defense, or otherwise, in any such suit, action or proceeding, (a) any claim that he or she is not personally subject to the jurisdiction of the above-named courts or that his or her property is exempt or immune from setoff, execution or attachment, either prior to judgment or in execution thereof, and (b) to the extent permitted by applicable law, any claim that such suit, action or proceeding is brought in an inconvenient forum or that the venue of suit, action or proceeding is improper or that this subscription agreement or any amendments or any replacements hereof may not be enforced in or by such courts. Venue for such actions as set forth above is intended to be inclusive.", "section_full_title": "16.Applicable Law", "document_id": "14tsEF5dHpm8B2kKm0TbpP.", "section_title": "Applicable Law"}, {"text": " The parties to this Subscription Agreement hereby waive any right that they may otherwise have to a trial by jury in any suit, action, or proceeding that arises out of or relates to this Subscription Agreement, any amendments to or any replacements of this Subscription Agreement, and any transactions or agreements relating to this Subscription Agreement. The parties understand that, as a result of this waiver, the facts relating to any dispute that is covered by this waiver will be tried, if necessary, to a judge rather than to a jury.", "section_full_title": "17.Waiver of Jury Trial", "document_id": "14tsEF5dHpm8B2kKm0TbpP.", "section_title": "Waiver of Jury Trial"}, {"text": " If any provision or portion of this Subscription Agreement is held to be unenforceable or invalid for any reason, the remaining provisions and portions of this Subscription Agreement shall be unaffected by such holding. [REMAINDER OF PAGE INTENTIONALLY LEFT BLANK] 8 SUBSCRIPTION AGREEMENT SIGNATURE PAGE In addition to the foregoing, the Subscriber hereby certifies that it (a) agrees to all the terms and conditions of this Subscription Agreement, (b) meets the suitability standards set forth in this Subscription Agreement, and (c) is a resident of the jurisdiction indicated below. I.NUMBER OF SUBSCRIBED UNITS Subscriber subscribes to purchase __________ Units (at $________ per Unit) of the Company (Units). II.PURCHASE PRICE.The total purchase price of the Units (the number of Units multiplied by price per Unit) is $______________ (the Purchase Price). III.TYPE OF OWNERSHIP AND REQUIRED DOCUMENTS AND SIGNATURES (please check one) [ ]INDIVIDUAL OWNERSHIP (one signature required) [ ]JOINT TENANTS WITH RIGHTS OF SURVIVORSHIP (both or all parties must sign) [ ]COMMUNITY PROPERTY (both husband and wife must sign) [ ]COMMUNITY PROPERTY WITH RIGHTS OF SURVIVORSHIP (both husband and wife must sign) [ ]TENANTS IN COMMON (both or all parties must sign) (indicate the interest of each Subscriber) [ ]PARTNERSHIP [ ]LIMITED PARTNERSHIP (State:_______) [ ]LIMITED LIABILITY COMPANY (State:_______) [ ]CORPORATION (State:______) [ ]TRUST (Type:_________) [ ]OTHER (Please specify:_________) IV.PURCHASER INFORMATION a.(Please print the exact name you desire to use for ownership. ) b.(Mailing address)  c. Primary Country of Residence: d. Telephone No.: _________________ Fax No.: e. Social Security or Employer Tax ID Number (if applicable): 9 V.REGISTRATION AND DELIVERY DETAILS a) Registered Holder Custodian of securities (if different than Part IV above): Name: b) Delivery details for securities certificates (if different than Part IV above): Name: Address: Executed this __day of _______________, 2009 at_____________________, ___________________. (City) (State/Country)  Signature of Subscriber Signature of Joint Subscriber By: ______________________________ By: Print Name and Title Print Name and Title ******************** SUBSCRIPTION ACCEPTED: AMERICAN SIERRA GOLD CORP. a Nevada corporation Dated: , 2009 By: Johannes Petersen, Chief Financial Officer 10", "section_full_title": "18.Severability", "document_id": "14tsEF5dHpm8B2kKm0TbpP.", "section_title": "Severability"}, {"text": " This Agreement shall terminate at the end of the Company's 2012 fiscal year on February 1, 2013, unless sooner terminated as provided herein or unless otherwise extended by the mutual written agreement of both parties.", "section_full_title": "2. Term", "document_id": "14vHNYotVUbEtqB2jZL9uY.", "section_title": " Term"}, {"text": " 3.1. Base Salary. Company shall increase Executive's annual base salary from its current level of $1,600,000 per year to $1,700,000 per year effective for the next fiscal year ended January 29, 2011 (\"fiscal 2010\"), payable in equal installments in accordance with Company's payroll practices for executive employees. Executive agrees to defer pursuant to Company's Deferred Compensation Plan the amount of base salary for each calendar year that is greater than $1,000,000. The Compensation and Stock Option Committee (the \"Committee\") of the Board will establish Executive's base salary and other compensation for fiscal 2011 and fiscal 2012 by notice to Executive prior to the end of the prior fiscal year, and base salary shall be not less than the amount for the immediately preceding fiscal year. 3.2. Cash Bonus. 3.2.1. Incentive Bonus. Executive will be eligible to receive an annual incentive bonus targeted at 130% of his base salary with a maximum bonus of 260% of base salary under the Company's 2005 Stock Award and Incentive Plan, as amended (\"the Plan\"). The Plan conditions the payment of this annual performance bonus based on achievement of pre-determined performance goals set forth in writing and based on objective measurements all established by the Committee. The Committee must verify that the performance goals and other material terms are met prior to payment. It is the parties' intention that the Plan be adopted and administered in a manner that enables Company to deduct for federal income tax purposes to the maximum extent possible the amount of any annual incentive bonus. The incentive bonus determined to be due, if any, will be paid within 120 calendar days after the close of Company's fiscal year and completion of an outside audit by Company's then current outside audit firm. 3.2.2. Long Term Incentive Cash Plan. Executive is eligible to receive a long term incentive bonus under the Company Long Term Incentive Cash Plan, which has been established under the Plan (the \"LTI Plan\"), for fiscal 2009 and has an account balance for prior years under the LTI Plan (the \"LTI Account\"). Executive will receive payment of: (a) one-half of the amount in the LTI Account on the day in spring 2010 when the other executives of the Company receive their fiscal 2010 payment; and (b) the entire remaining amount in the LTI Account on the day in spring 2011 when the other executives of the Company receive their fiscal 2011 payment. It is the Company's intention that the LTI Plan be adopted and administered in a manner that enables Company to deduct for federal income tax purposes all amounts paid pursuant to the LTI Plan. 3.3. Long Term Equity Compensation. Executive shall receive long term equity incentive compensation under the Plan for each fiscal year on terms similar to those of other senior executives at the Company as set forth below. 3.3.1. Restricted Stock Unit Awards. The Chairman shall recommend to the Committee that Executive receive three annual grants of restricted stock unit awards during the term of this Agreement, one for each of fiscal years 2010, 2011 and 2012, with each grant made pursuant to and subject to all terms and conditions set forth in the Plan. For fiscal 2010 the size of the award shall be equal to the number of shares of Company's common stock equal to $3,990,000 divided by the closing sale price on the grant date. The amount of the award for fiscal years 2011 and 2012 shall be fixed by the Committee. Pursuant to the terms of the Plan, each restricted stock unit award will vest and be paid in three equal annual installments. Either the grant or the vesting of the awards will be subject to achievement of pre-determined performance goals set forth in writing and based on objective measurements all established by the Committee. The Committee must verify that the performance goals and other material terms are met prior to any vesting or payment. It is the parties' intention that the Plan be adopted and administered in a manner that enables the Company to deduct for federal income tax purposes to the maximum extent possible the value of all restricted stock unit awards. The delivery of restricted stock earned will be made on the business day closest to the anniversary of the grant date as set forth in the award agreement. Any restricted stock unit awards unvested at the time of termination of Executive's employment shall (subject to achievement of any applicable performance goals) continue to vest without pro-ration; provided, however, that if employment is terminated by Executive's disability (as that term is defined in Treasury Regulation Section 1.409A-3(i)(4)) or death all such awards shall immediately vest in full and shall be paid within 30 days after such disability or death, and; provided, further, if employment is terminated \"for cause,\" all such unvested awards shall lapse . 3.3.2 Long-term Performance Restricted Stock Unit Awards. The Chairman shall recommend to the Committee that Executive receive three annual grants of long-term performance restricted stock unit awards during the term of this Agreement, one for each of fiscal years 2010, 2011 and 2012, with each grant made pursuant to and subject to all terms and conditions set forth in the Plan. For fiscal 2010 the size of the award shall be equal to the number of shares of Company's common stock equal to $2,850,000 divided by the closing sale price on the grant date. The amount of the award for fiscal years 2011 and 2012 shall be fixed by the Committee. Pursuant to the terms of the Plan, the Committee will condition the vesting of this restricted stock based on achievement of pre-determined performance goals set forth in writing and based on objective measurements all established by the Committee. The Committee must verify that the performance goals and other material terms are met prior to vesting (as certified by an outside audit by Company's then current outside audit firm for the fiscal year applicable to the respective performance goal). It is the parties' intention that the Plan be adopted and administered in a manner that enables Company to deduct for federal income tax purposes to the maximum extent possible the value of all long-term performance restricted stock unit awards. The delivery of restricted stock earned, if any, will be made within 120 calendar days after the close of Company's fiscal year. Any long-term performance restricted stock unit awards unvested at the time of termination of Executive's employment shall (subject to achievement of the applicable performance goals) continue to vest without pro-ration and shall be paid within 30 days after such vesting; provided, however, if employment is terminated \"for cause,\" all such unvested awards shall lapse. 3.3.3. Stock Options. The Chairman shall recommend to the Committee that Executive receive three grants of stock options during the term of this Agreement, the first for fiscal 2010, the second in fiscal 2011 and the third in fiscal 2012, with each grant made pursuant to and subject to all terms and conditions set forth in the Plan. The fiscal 2010 grant shall be made the date this Agreement is executed and shall be for the number of shares of Company's common stock with a grant date value equal to $4,560,000 based on the method used by the Company for computing stock option expense for financial statement purposes and with an exercise price equal to the fair market value of the common stock on the grant date as defined in the Plan. The fiscal 2011 and 2012 grants shall be made on the dates that other executive officers of Company receive their annual stock option grants and shall be for the number of shares of Company's common stock with a grant date value to be determined by the Committee. Each option shall vest and be exercisable as to one third of the amount of the grant on each of the first three anniversaries of the grant date. Any stock options unvested at the time of termination of Executive's employment shall continue to vest without pro-ration; provided, however, that if employment is terminated by Executive's disability (as that term is defined in Treasury Regulation Section 1.409A-3(i)(4)) or death, all such options shall immediately vest in full and; provided, further, if employment is terminated \"for cause,\" all such unvested options shall lapse. Options will be exercisable until the earlier of (a) seven years from the grant date, or (b) (i) for options that are or become exercisable upon the termination of Executive's employment (including those accelerated on death or disability), for one year after the termination of employment and (ii) for options that are not exercisable upon the termination of Executive's employment, the options shall continue to vest and shall be exercisable for one year after the vesting date when such options first become exercisable. 3.4. Vacation. During the term of this Agreement, Executive shall be entitled to vacation commensurate with other senior executives. The dates of said vacations shall be mutually agreed upon by Company's Chairman and Executive. 3.5. Car and Commuting Expenses. During the term of this Agreement, Company will provide Executive with a luxury automobile for both business and personal use. Company will make available charter air and car services to Executive for business purposes and for commuting to and from work. Company shall pay Executive's reasonable car and train commuting expenses and Executive will reimburse the Company for charter air services used for commuting. Any amount included in Executive's W-2 wages relative to the car or commuting expenses shall be not be grossed up for tax purposes. 3.6. Business Expenses. Company shall pay, advance or reimburse Executive for all normal and reasonable business-related expenses incurred by Executive during the term of this Agreement, including travel expenses, incurred in the performance of his duties on the same basis as paid to other senior executives. Company shall furnish Executive with company credit cards provided to other senior executives for use solely in the performance of his duties. The amount of expenses eligible for reimbursement during a taxable year of the Executive shall not affect the expenses eligible for reimbursement in any other taxable year. 3.7. Taxes. The compensation provided to Executive hereunder shall be subject to any withholdings and deductions required by any applicable tax laws. 3.8. Benefit Plans. During the term of this Agreement, Executive is entitled to participate in any deferred compensation or other employee benefit plans, including any profit sharing or 401(k) plans; group life, health, hospitalization and disability insurance plans; discount privileges; and other employee welfare benefits made available generally to, and under the same terms as, Company's other executives.", "section_full_title": "3. Compensation", "document_id": "14vHNYotVUbEtqB2jZL9uY.", "section_title": " Compensation"}, {"text": " 4.1. Confidential Information. Executive agrees that during and after his employment, any \"confidential information\" as defined below shall be held in confidence and treated as proprietary to Company. Executive agrees not to use or disclose any confidential information except to promote and advance the business interests of Company. Executive agrees that upon his separation from employment, for any reason whatsoever, he shall not take or copy, and shall immediately return to Company, any documents that constitute or contain confidential information. \"Confidential information\" includes, but is not limited to, any confidential data, figures, projections, estimates, pricing data, customer lists, buying manuals or procedures, distribution manuals or procedures, other policy and procedure manuals or handbooks, supplier information, tax records, personnel histories and records, information regarding sales, information regarding properties and any other confidential information regarding the business, operations, properties or personnel of Company which are disclosed to or learned by Executive as a result of his employment, but shall not include his personal personnel records. Confidential information shall not include any information that (i) Executive possessed prior to his first performing services for Company; (ii) becomes a matter of public knowledge thereafter through sources independent of Executive; (iii) is disclosed by Company without restriction on its use; or (iv) is required to be disclosed by law or governmental order or regulation. 4.2. Solicitation. 4.2.1. Employees. Executive agrees that during his employment and for two years after the end of his employment, for any reason, he shall not, directly or indirectly, solicit Company's employees to leave their employment; he shall not employ or seek to employ them; and, he shall not cause or induce any of Company's competitors to solicit or employ Company's employees. 4.2.2. Third Parties. Executive agrees that during his employment and for two years following the end of his employment, for any reason, he shall not, either directly or indirectly, recruit, solicit or otherwise induce or influence any customer, supplier, sales representative, lender, landlord or any other person having a business relationship with Company to discontinue or reduce the extent of such relationship except in the course of his duties pursuant to this Agreement and with the good faith objective of advancing Company's business interests. 4.3. Noncompetition. Executive agrees that for a period of two years following the end of his employment, for any reason, he shall not, either directly or indirectly, accept employment with, act as a consultant to, or otherwise perform the same services (which shall be determined regardless of job title) for any business that directly competes with Company's business, which is understood to be the design, manufacture and retail sale (including Internet sales) of specialty clothing, accessories, shoes, and related items or any other line of business the Company becomes involved in prospectively by virtue expansion, acquisition and/or joint venture. 4.4. Cooperation. 4.4.1. With Company. Executive agrees to cooperate with Company during the course of all third-party proceedings arising out of Company's business about which Executive has knowledge or information. Such proceedings may include, but are not limited to, internal investigations, administrative investigations or proceedings, and lawsuits (including pre-trial discovery). For purposes of this paragraph, cooperation includes, but is not limited to, Executive's making himself available for interviews, meetings, depositions, hearings, and/or trials without the need for subpoena or assurances by Company, providing any and all documents in his possession that relate to the proceeding, and providing assistance in locating any and all relevant notes and/or documents. 4.4.2. With Third Parties. Executive agrees to communicate with, or give statements to, third parties relating to any matter about which Executive has knowledge or information as a result of his employment only to the extent that it is Executive's good faith belief that such communication or statement is in Company's business interests. 4.4.3. With Media. Executive agrees to communicate with, or give statements to, any member of the media (print, television or radio) relating to any matter about which Executive has knowledge or information as a result of his employment only to the extent that it is Executive's good faith belief that such communication or statement is in Company's business interests. 4.5. Remedies. Executive agrees that any disputes under this paragraph shall not be subject to arbitration. If Executive breaches this paragraph, the damage will be substantial, although difficult to quantify, and money damages may not afford Company an adequate remedy; therefore, if Employee breaches or threatens to breach this paragraph, Company shall be entitled, in addition to other rights and remedies, to specific performance, injunctive relief and other equitable relief to prevent or restrain such conduct.", "section_full_title": "4. Executive's Obligations", "document_id": "14vHNYotVUbEtqB2jZL9uY.", "section_title": " Executive's Obligations"}, {"text": " 5.1. Death. This Agreement shall terminate automatically upon Executive's death, and Company shall pay his estate, any base salary earned by Executive, and any rights or benefits that have vested, including: (a) the Retirement Benefit (as hereinafter defined); (b) the LTI Account; (c) restricted stock unit awards that have not been paid by delivery of stock prior to the termination of Executive's employment by reason of death shall immediately vest in full and be paid by delivery of stock within 30 days after Executive's death ; (d) long-term performance restricted stock unit awards that have not been paid by delivery of stock prior to the termination of Executive's employment by reason of death shall (subject to achievement of the applicable performance goals) continue to vest in full, and be paid, without pro-ration, by delivery of stock within 30 days of vesting if the performance goal is met; and (e) all stock options immediately vest in full and will be exercisable until the earlier of (i) the expiration date set forth in the stock option award agreement, or (ii) one year after the termination of employment. In addition, Company shall pay Executive's estate, any declared but unpaid annual incentive cash bonus that, but for Executive's death, would otherwise have been payable to Executive. Such payments shall be made in the time and manner specified in Section 5.7 of this Agreement. 5.2. Permanent Disability. Upon Executive's permanent disability, Company shall have the right to terminate this Agreement immediately with written notice. For these purposes, permanent disability shall mean that Executive fails to perform his duties on a full-time basis for a period of more than 90 calendar days during any 12-month period, due to a physical or mental disability or infirmity. If this Agreement is terminated due to Executive's permanent disability, Company shall pay Executive any base salary earned and any rights or benefits that have vested, including: (a) the Retirement Benefit (as hereinafter defined); (b) the LTI Account; (c) restricted stock unit awards that have not been paid by delivery of stock prior to the termination of Executive's employment by reason of disability shall immediately vest in full and be paid by delivery of stock within 30 days after Executive's disability; (d) long-term performance restricted stock unit awards that have not been paid by delivery of stock prior to the termination of Executive's employment by reason of disability shall (subject to achievement of the applicable performance goals) continue to vest in full, and be paid, without pro-ration, by delivery of stock within 30 days after vesting if the performance goal is met; and (e) all stock options shall immediately vest in full and will be exercisable until the earlier of (i) the expiration date set forth in the stock option award agreement, or (ii) one year after the termination of employment. In addition, Company shall pay Executive any declared but unpaid annual incentive cash bonus that, but for Executive's disability, would otherwise have been payable to Executive. Such payments shall be made in the time and manner specified in Section 5.7 of this Agreement. 5.3. Retirement. 5.3.1. Retirement Benefit. Upon termination of Executive's employment with the Company for any reason, other than \"for cause\" as specified in paragraph 5.5 of this Agreement, Company shall pay to Executive, or in the event of Executive's death to his estate, a retirement benefit in an amount equal to Executive's total cash compensation (base salary plus any annual incentive bonus) for the highest compensated fiscal year of the prior seven fiscal years (the \"Retirement Benefit\"). Because Executive has earned a retirement benefit under his prior employment agreement, upon any termination of Executive's employment for any reason, other than \"for cause\" as specified in paragraph 5.5 of this Agreement, the Retirement Benefit will be at least $3,419,231.00. If Executive retires on or after February 1, 2013, then, subject to Section 5.8 of this Agreement, the Retirement Benefit shall be payable over five years in one hundred and thirty (130) equal bi-weekly installments on the same schedule as the Company's payroll beginning with the first pay period after termination of Executive's employment. If Executive retires before February 1, 2013, the Retirement Benefit shall be paid in the manner provided under Section 5.7 of this Agreement. 5.3.2. Retirement Health Insurance. Upon termination of Executive's employment with the Company for any reason, Company shall make available to Executive retirement health insurance for Executive and his dependents for his lifetime. Executive will pay all associated premiums for coverage. 5.4. Termination By Company Without Cause. The Company shall have the right, in addition to its rights set forth below in paragraph 5.5, to terminate this Agreement during its term, for any reason, upon 30 days' written notice to Executive. Company may, in its sole discretion, require Executive to cease active employment immediately. In the event of such a termination, Company shall have only the following obligations: Pay Executive his earned but unpaid base salary, and all deferred compensation as provided in paragraph 5.8. Pay Executive severance in an amount equal to one year of Executive's then current base salary (the \"Severance Payment\") in the manner provided under Section 5.7 of this Agreement. Pay Executive the Retirement Benefit in the manner provided under Section 5.7 of this Agreement. Pay Executive any annual cash incentive bonus to the extent that the performance goals established at the time of grant are met for the fiscal year during which termination occurred, even though Executive was not employed for the entire fiscal year. Outstanding stock options held by Executive shall remain exercisable until the earlier of (i) the expiration date set forth in the stock option award agreement, or (ii) (A) for options that are vested as of the termination of Executive's employment, for one year after the termination of employment and (B) for options that are not vested as of the termination of Executive's employment, the options shall continue to vest and shall be exercisable for one year after the vesting date when such options first become exercisable. Restricted stock unit awards that have not been paid by delivery of stock prior to the termination of Executive's employment shall continue to vest, without pro-ration, and be paid on the same schedule as if Executive's employment had not terminated. Long-term performance restricted stock unit awards that have not been paid by delivery of stock prior to the termination of Executive's employment shall continue to vest, without pro-ration, and be paid on the same schedule as if Executive's employment had not terminated by delivery of stock in the same manner upon vesting, to the extent that the performance goals established at the time of grant are met, even though Executive was not employed for the entire applicable performance period. Pay Executive the LTI Account in the manner provided under Section 5.7 of this Agreement. 5.5. Termination by Company For Cause. Company may terminate this Agreement during its term if it has \"cause\" to do so. For purposes of this paragraph, the term \"cause\" means the following: (i) willful violation of laws and regulations governing Company; (ii) willful failure to substantially comply with any material terms of this Agreement, provided Company shall make a written demand for substantial compliance setting forth the specific reason(s) for same and Executive shall have 60 days to cure, if possible; (iii) willful breach of fiduciary duties; or (iv) conviction of or plea of guilty or no contest to a felony, involving fraud, bribery or embezzlement; in each case only where Company reasonably determines the event has had or is likely to have a material adverse effect upon Company's operations or financial condition. Failure to meet performance targets and measures shall not constitute \"cause\" as that term is used herein. Executive may have an opportunity to be heard by the Board prior to a termination for cause. For purposes of this paragraph, Executive's acts or omissions shall be considered \"willful\" if done without a good faith, reasonable belief that such act or omission was in Company's best interest. In the event of termination for cause, Company shall pay Executive any base salary earned and any rights or benefits that have vested, including any declared but unpaid annual incentive cash bonus, the LTI Account, all deferred compensation, and any vested equity awards but excluding the Retirement Benefit, which shall be forfeited in its entirety as will all unvested equity awards. 5.6. Early Retirement. Executive may terminate this Agreement by electing early retirement at any time by giving at least 60 calendar days' written notice of his intention to retire to Company's Chairman, which Company may accept immediately. In the event of Executive's early retirement, Company will have no further obligations or liability hereunder to Executive, except Company shall pay Executive any base salary earned, and declared but unpaid bonuses, and any rights or benefits that have vested, including: (a) the Retirement Benefit; (b) the LTI Account; (c) restricted stock unit awards that have not been paid by delivery of stock prior to the termination of Executive's employment by reason of retirement shall continue to be paid, without pro-ration, by delivery of stock in the same manner on the anniversary of the grant on the same schedule as if Executive's employment had not terminated; (d) long-term performance restricted stock unit awards that have not been paid by delivery of stock prior to the termination of Executive's employment by reason of retirement shall continue to vest, without pro-ration, and be paid on the same schedule as if Executive's employment had not terminated by delivery of stock in the same manner upon vesting, to the extent that the performance goals established at the time of grant are met, even though Executive was not employed for the entire applicable performance period; and (e) stock options shall remain exercisable until the earlier of (i) the expiration date set forth in the stock option award agreement, or (ii) (A) for options that are vested as of the termination of Executive's employment, for one year after the termination of employment and (B) for options that are not vested as of the termination of Executive's employment, for one year after the vesting date when such options first become exercisable. Provided, however, that notwithstanding the forgoing and anything in this Agreement to the contrary, all restricted stock unit awards, long-term performance restricted stock unit awards, and stock option awards that were made or granted within six months prior to Executive's retirement shall terminate and shall never vest or become exercisable. 5.7. Payments Due Upon a Termination Before February 1, 2013. In the event of any termination of Executive's employment under this Agreement prior to February 1, 2013, Executive (or his estate) shall be paid any unpaid portion of his salary that has accrued by virtue of his employment during the period prior to termination, and any unpaid, declared bonus, together with any unpaid business expenses properly incurred under this Agreement prior to termination. Such amounts shall be paid within 15 days of the date of termination, unless otherwise provided herein. Executive (or his estate) shall also have the right to exercise stock options in accordance with the terms of this Agreement, and Executive shall receive payout of the LTI Account, any Severance Payment owed to Executive, and the Retirement Benefit in a lump sum within 30 days of the termination, except as otherwise provided under Section 5.8 of this Agreement. 5.8. Timing of Payments. Notwithstanding anything in any subsection of this Section 5 to the contrary, if, when Executive's employment with Company terminates, Company believes that any payments under this Agreement will result in additional tax or interest to Executive under Internal Revenue Code Section 409A and the guidance promulgated there under (\"Code Section 409A\"), Company may suspend the payments to Executive under this Section 5 of amounts due within the first six months after the termination date. If Company suspends any payments, it will aggregate and pay these amounts to Executive on the earliest of (a) the date that is six months and one day after the termination date, (b) the date of the Executive's death, or (c) any earlier date that does not result in such additional tax or interest under Code Section 409A. In addition, any compensation deferred under the Company's Deferred Compensation Plan or otherwise in accordance with this Agreement shall be paid to Executive following the date of his termination of employment for any reason in accordance with Executive's payment elections on file.", "section_full_title": "5. Termination and Related Benefits", "document_id": "14vHNYotVUbEtqB2jZL9uY.", "section_title": " Termination and Related Benefits"}, {"text": " Unless stated otherwise herein, the parties agree that arbitration shall be the sole and exclusive remedy to redress any dispute, claim or controversy involving the interpretation of this Agreement or the terms, conditions or termination of this Agreement or the terms, conditions or termination of Executive's employment with Company. The parties intend that any arbitration award shall be final and binding and that a judgment on the award may be entered in any court of competent jurisdiction and enforcement may be had according to its terms. This paragraph shall survive the termination or expiration of this Agreement. 6.1 Arbitration shall be held in Pittsburgh, PA, and shall be conducted by a retired federal judge or other qualified arbitrator mutually agreed upon by the parties in accordance with the Voluntary Arbitration Rules of the American Arbitration Association then in effect. The parties shall have the right to conduct discovery pursuant the Federal Rules of Civil Procedure; provided, however, that the Arbitrator shall have the authority to establish an expedited discovery schedule and cutoff and to resolve any discovery disputes. The Arbitrator shall not have jurisdiction or authority to change any provision of this Agreement by alterations of, additions to or subtractions from the terms hereof. The Arbitrator's sole authority in this regard shall be to interpret or apply any provision(s) of this Agreement. The Arbitrator shall be limited to awarding compensatory damages, including unpaid wages or benefits, but shall have no authority to award punitive, exemplary or similar-type damages. 6.2 Any claim or controversy not sought to be submitted to arbitration, in writing, within 120 days of when it arose shall be deemed waived and the moving party shall have no further right to seek arbitration or recovery with respect to such claim or controversy. 6.3 The arbitrator shall be entitled to award expenses, including the costs of the proceeding, and reasonable counsel fees. 6.4 The parties hereby acknowledge that since arbitration is the exclusive remedy, neither party has the right to resort to any federal, state or local court or administrative agency concerning breaches of this Agreement, except as otherwise provided herein in paragraph 6, and that the decision of the Arbitrator shall be a complete defense to any suit, action or proceeding instituted in any federal, state or local court before any administrative agency with respect to any arbitrable claim or controversy.", "section_full_title": "6. Arbitration", "document_id": "14vHNYotVUbEtqB2jZL9uY.", "section_title": " Arbitration"}, {"text": " 7.1. The parties agree that the covenants and promises set forth in paragraphs 4, 5 and 6 shall survive the termination of this Agreement and continue in full force and effect for the time periods set forth therein. 7.2. Except as otherwise provided in paragraph 6.2 above, failure to insist upon strict compliance with any term hereof shall not be considered a waiver of any such term. 7.3. This Agreement, along with any other document or policy or practice referenced herein (which are collectively referred to as \"Agreement\" herein), contain the entire agreement of the parties regarding Executive's employment and supersede any prior written or oral agreements or understandings relating to the same. No modification or amendment of this Agreement shall be valid unless in writing and signed by or on behalf of both parties. 7.4. If Executive's employment terminates, for any reason whatsoever, he shall immediately tender his written resignation from the Board, if applicable, which resignation the Chairman may or may not accept. 7.5. Executive represents and warrants to Company that he is not now under, or bound to be under in the future, any obligation to any person, firm or corporation which is or would be inconsistent or in conflict with this Agreement, or that would prevent, limit, or impair in any way the performance of his obligations hereunder. 7.6. Once signed by both parties, this Agreement shall be binding upon and shall inure to the benefit of the heirs, successors, and assigns of the parties. 7.7. This Agreement is intended to be performed in accordance with, and only to the extent permitted by, all applicable laws, ordinances, rules and regulations. If any provisions of this Agreement, or the application thereof to any person or circumstance, shall, for any reason and to any extent, be held invalid or unenforceable, such invalidity and unenforceability shall not affect the remaining provisions hereof and the application of such provisions to other persons or circumstances, all of which shall be enforced to the greatest extent permitted by law. 7.8. The validity, construction, and interpretation of this Agreement and the rights and duties of the parties hereto shall be governed by the laws of the Commonwealth of Pennsylvania, without reference to the Pennsylvania choice of law rules. 7.9. Any written notice required or permitted hereunder shall be mailed, certified mail (return receipt requested) or hand-delivered, addressed to Company's Chairman at Company's then principal office, or to Executive at the most recent home address. Notices are effective upon receipt. 7.10. The rights of Executive under this Agreement shall be solely those of an unsecured general creditor of Company. 7.11. The headings in this Agreement are inserted for convenience of reference only and shall not be a part of or control or affect the meaning of any provision hereof. 7.12. To the extent that any provisions of this Agreement do not comply with Code Section 409A, which would cause Executive to incur any additional tax or interest under Code Section 409A, such terms of the Agreement shall be deemed to be modified, to the extent reasonably possible to do so, and applied by Company in a manner to be consistent with Code Section 409A. IN WITNESS WHEREOF, the parties have duly executed and delivered this Agreement consisting of 12 pages. EXECUTIVE /s/ James V. O'Donnell James V. O'Donnell Dated: January 11, 2010 AMERICAN EAGLE OUTFITTERS, INC. By: /s/ Jay L. Schottenstein Jay L. Schottenstein Chairman Dated: January 11, 2010", "section_full_title": "7. General Provisions", "document_id": "14vHNYotVUbEtqB2jZL9uY.", "section_title": " General Provisions"}, {"text": "  The Borrower hereby represents and warrants to the Administrative Agent and the Syndication Parties as follows: (a) The Borrower has all requisite power and authority, corporate or otherwise, to execute and deliver this Amendment and to perform its obligations under this Amendment and the Loan Documents to which the Borrower is a party This Amendment and the Loan Documents to which the Borrower is a party have been duly and validly executed and delivered to the Administrative Agent by the Borrower, and this Amendment and the Loan Documents to which the Borrower is a party constitute the Borrowers legal, valid and binding obligations, enforceable in accordance with their terms. (b) The execution, delivery and performance by the Borrower of this Amendment and the Loan Documents to which the Borrower is a party have been duly authorized by all necessary corporate or other action and do not and will not (i) require any authorization, consent or approval by any governmental department, commission, board, bureau, agency or instrumentality, domestic or foreign, (ii) violate the Borrowers organizational documents or any provision of any law, rule, regulation or order presently in effect having applicability to the Borrower, or (iii) result in a breach of, or constitute a default under, any indenture or agreement to which the Borrower is a party or by which the Borrower or its properties may be bound or affected (c) All of the representations and warranties contained in Article 8 of the Credit Agreement are correct on and as of the date hereof as though made on and as of such date, except to the extent that such representations and warranties relate solely to an earlier date. -6-", "section_full_title": "Section 4.Representations and Warranties.", "document_id": "154JyRLTs2pJChvO7B3PzZ.", "section_title": "Representations and Warranties."}, {"text": "  This Amendment shall be effective only if the Administrative Agent has received, on or before the date of this Amendment (or such later date as the Administrative Agent may agree in writing), each of the following, each in form and substance acceptable to the Administrative Agent in its sole discretion: (a) this Amendment, duly executed by the Borrower, the Administrative Agent and the Syndication Parties; (b) payment of an amendment fee of $15,000 in immediately available funds, to be allocated by the Administrative Agent pro rata among the Syndication Parties; and (c) payment of an administration fee of $5,000 in immediately available funds, payable to and for the account of the Administrative Agent.", "section_full_title": "Section 5.Effectiveness.", "document_id": "154JyRLTs2pJChvO7B3PzZ.", "section_title": "Effectiveness."}, {"text": "  All references in the Credit Agreement to this Agreement shall be deemed to refer to the Credit Agreement as amended hereby, and any and all references in any other Loan Document to the Credit Agreement shall be deemed to refer to the Credit Agreement as amended hereby.", "section_full_title": "Section 6.References.", "document_id": "154JyRLTs2pJChvO7B3PzZ.", "section_title": "References."}, {"text": "  The execution of this Amendment and any documents related hereto shall not be deemed to be a waiver of any Potential Default or any Event of Default under the Credit Agreement or any breach, default or event of default under any other Loan Document or other document held by the Administrative Agent or any Syndication Party, whether or not known to the Administrative Agent or any Syndication Party and whether or not existing on the date of this Amendment.", "section_full_title": "Section 7.No Waiver.", "document_id": "154JyRLTs2pJChvO7B3PzZ.", "section_title": "No Waiver."}, {"text": "  The Borrower hereby absolutely and unconditionally releases and forever discharges the Administrative Agent and the Syndication Parties, and any and all participants, parent corporations, subsidiary corporations, affiliated corporations, insurers, indemnitors, successors and assigns thereof, together with all of the present and former directors, officers, agents and employees of any of the foregoing, from any and all known claims, demands or causes of action of any kind, nature or description, whether arising at law or in equity or upon contract or tort or under any state or federal law or otherwise, which the Borrower has had, now has or may claim to have against any such Person for or by reason of any act, omission, matter, cause or thing whatsoever arising from the beginning of time to and including the date of this Amendment, whether such claims, demands and causes of action are matured or unmatured.", "section_full_title": "Section 8.Release of Administrative Agent and Syndication Parties.", "document_id": "154JyRLTs2pJChvO7B3PzZ.", "section_title": "Release of Administrative Agent and Syndication Parties."}, {"text": "  The Borrower hereby reaffirms its agreement under Section 15.1 of the Credit Agreement to pay or reimburse the Administrative Agent and the Syndication Parties on demand for all costs and expenses incurred by the Administrative Agent and the Syndication Parties in their employment of counsel. Without limiting the generality of the foregoing, the Borrower specifically agrees to pay all fees and disbursements of counsel to the Administrative Agent for the services performed by such counsel in connection with the preparation of this Amendment and the documents and instruments incidental hereto. -7-", "section_full_title": "Section 9.Costs and Expenses.", "document_id": "154JyRLTs2pJChvO7B3PzZ.", "section_title": "Costs and Expenses."}, {"text": "  Except as expressly set forth herein, all terms of the Credit Agreement and the other Loan Documents remain in full force and effect. This Amendment may be executed in any number of counterparts, each of which when so executed and delivered shall be deemed to be an original and all of which counterparts, taken together, shall constitute but one and the same instrument. This Amendment shall be governed by the internal laws of the State of Colorado. Signature page follows -8- IN WITNESS WHEREOF, the undersigned have executed this Amendment as of the day and year first above written. NATIONAL COOPERATIVE REFINERY ASSOCIATION, as Borrower By: /s/ John G. Buehrle Name: John G. Buehrle Title: CFO COBANK, ACB, as Administrative Agent and as a Syndication Party By: /s/ Michael Tousignant Name: Michael Tousignant Title: Vice President U.S. AGBANK By: /s/ Travis W. Ball Name: Travis W. Ball Title: Vice President Signature Page to Seventh Amendment to 2003 Amended and Restated Credit Agreement (2-Year Revolving Loan) Exhibit 1.21 to Amendment EXHIBIT 1.21 TO 2003 AMENDED AND RESTATED CREDIT AGREEMENT COMPLIANCE CERTIFICATE National Cooperative Refinery Association CoBank, ACB 5500 South Quebec Street Greenwood Village, Colorado 801 11 ATTN: Administrative Agent, National Cooperative Refinery Association Loan Gentlemen: As required by Subsections 10.2.1 and 10.2.2 of that certain 2003 Amended and Restated Credit Agreement dated as of December 16, 2003 (as amended, restated, supplemented or otherwise modified from time to time, the Credit Agreement), by and among National Cooperative Refinery Association (the Company), the Syndication Parties as defined therein and CoBank, ACB, in its capacity as administrative agent for the Syndication Parties, a review of the activities of the Company for the [Fiscal Quarter] [Fiscal Year] ending , 200___ (the Fiscal Period) has been made under my supervision with a view to determine whether the Company has kept, observed, performed and fulfilled all of its obligations under the Credit Agreement and all other agreements and undertakings contemplated thereby. To the best of my knowledge, and based upon such review, I certify, in my capacity as [Chief Financial Officer] OR [corporate treasurer] of the Company, that no event has occurred which constitutes, or which with the passage of time or service of notice, or both, would constitute, an Event of Default or a Potential Default as defined in the Credit Agreement. I further certify that (a) to the best of my knowledge the amounts set forth on the attachment accurately present amounts required to be calculated in accordance with the financial covenants contained in the Credit Agreement as of the last day of the Fiscal Period (unless expressly specified herein); and (b) also attached as Schedule A are detailed calculations showing how such amounts were determined. All capitalized terms used but not defined herein have the meanings given in the Credit Agreement. Very truly yours, National Cooperative Refinery Association By: Name: Title: Chief Financial Officer/Treasurer Capitalized terms used herein shall have the definitions set forth in the Credit Agreement. SUBSECTION 10.16.1: DEBT TO EBITDA RATIO Test: Measured over the immediately preceding four (4) Fiscal Quarters: (a) Debt divided by (b) EBITDA. Target: Not in excess of 3.00 to 1.00 at any time. Debt to EBITDA Ratio (Actual) As of Fiscal Quarter ended : SUBSECTION 10.16.2: MINIMUM NET WORTH Test: Measured at the end of each Fiscal Quarter, Net Worth. Target: Not less than $600,000,000. Net Worth As of Fiscal Quarter ended :  $ SUBSECTION 10.16.3: INTEREST COVERAGE RATIO Test: Measured over the immediately preceding four (4) Fiscal Quarters: (a) EBIT divided by (b) Interest Expense. Target: Not less than 4.00 to 1.00 as of the last day of each Fiscal Quarter. Interest Coverage Ratio (actual) As of Fiscal Quarter ended : SUBSECTION 10.16.4: MINIMUM WORKING CAPITAL Test: Current assets minus current liabilities. Target: Not less than $75,000,000 as of the last day of each Fiscal Quarter for each Fiscal Year Current assets minus current liabilities (Actual) As of Fiscal Quarter ended :  $ -2- SCHEDULE A DETAILED CALCULATIONS DEBT TO EBITDA (000s) Debt (current measurement period) Current Portion Long Term Debt Capital Leases 364-Day Facility Other Total Debt EBITDA (rolling 4 quarters) Net Income Interest Expense Federal and State Income Taxes Extraordinary Losses Depreciation Amortization Less: Extraordinary Gains Non-cash Patronage Income Total EBITDA Debt to EBITDA Ratio Maximum Ratio Permitted 3.00 to 1.00 MINIMUM NET WORTH (000s) Total Assets Less Total Liabilities Net Worth INTEREST COVERAGE RATIO (000s) EBIT (rolling 4 quarters) Net Income Interest Expense Federal and State Income Taxes Extraordinary Losses Less: Extraordinary Gains Non-cash Patronage Income Total EBIT Interest Expense (rolling 4 quarters) EBIT to Interest Minimum Ratio Permitted 4.00 to 1.00 WORKING CAPITAL Current Assets Less Current Liabilities Working Capital -3- Exhibit 1.76 to Amendment EXHIBIT 1.76 TO 2003 AMENDED AND RESTATED CREDIT AGREEMENT SUBSIDIARIES Kaw Pipe Line Company 66.667%  Osage Pipeline Company, LLC 50.00%  Jayhawk Pipeline, L.L.C. 100 % McPherson Agricultural Products, LLC 100 % Ex. 1.76Exhibit 8. 11 to Amendment EXHIBIT 8.11 TO 2003 AMENDED AND RESTATED CREDIT AGREEMENT EQUITY INVESTMENTS Subsidiary Investment 1.Jayhawk Pipeline, L. L.C. $ 35,453,202 2.Kaw Pipe Line Company  $ 1,863,117 3.Osage Pipeline Company, LLC  $ 4,072,685 4.McPherson Agricultural Products, LLC  $ (4,230,554 ) Ex. 8.11", "section_full_title": "Section 10.Miscellaneous.", "document_id": "154JyRLTs2pJChvO7B3PzZ.", "section_title": "Miscellaneous."}, {"text": "  The Lease Term of the Existing Lease shall terminate effective as of December 31, 2009 (Effective Termination Date). Whereas Tenant is in occupancy of the Premises, Tenant shall remain in the Premises after the Effective Termination Date, in accordance with and pursuant to the terms and conditions set forth in the New Lease.", "section_full_title": "1.TERMINATION OF LEASE TERM", "document_id": "180qW5LiKhjqbih6MaWJp1.", "section_title": "TERMINATION OF LEASE TERM"}, {"text": "  Tenant acknowledges that Tenants payments on account of Operating Charges in respect of the Existing Lease through the Effective Termination Date shall have been based upon estimated amounts of Operating Charges in respect of the Existing Lease for calendar year 2009. At the time that the actual amount of Operating Charges in respect of the Existing Lease for calendar year 2009 are determined, Tenant shall promptly pay any underpayment of Operating Charges in respect to the Existing Lease to Landlord, or Landlord shall promptly apply any overpayment of Operating Charges in respect of the Existing Lease to the next installment(s) of yearly Rent under the New Lease.", "section_full_title": "2.OPERATING CHARGES", "document_id": "180qW5LiKhjqbih6MaWJp1.", "section_title": "OPERATING CHARGES"}, {"text": "  For all purposes of the Existing Lease, the notice addresses for Landlord is as follows: Reston Town Center Property LLC c/o Beacon Capital Partners, LLC 200 State Street, 5th Floor Boston, Massachusetts 02109 With a copy to: Goulston & Storrs, P.C. 400 Atlantic Avenue Boston, Massachusetts 02110 Attn: Market Square  Reston Town Center -2-", "section_full_title": "3.NOTICES", "document_id": "180qW5LiKhjqbih6MaWJp1.", "section_title": "NOTICES"}, {"text": "  The parties hereby acknowledge that Landlord is only willing to execute this Termination Agreement in the event that Tenant executes and delivers the New Lease to Landlord. Therefore, Landlord shall have the right, exercisable upon written notice to Tenant, to render this Termination Agreement void and without further force or effect, unless Tenant executes and delivers to Landlord the New Lease. [SIGNATURES ON FOLLOWING PAGE] -3- EXECUTED UNDER SEAL as of the date first above written. LANDLORD: RESTON TOWN CENTER PROPERTY LLC, a Delaware limited liability company By: /s/ Jeffrey L. Kovach Name: Jeffrey L. Kovach Title: Senior Vice President Date Signed: 1/6/2010 TENANT: LEARNING TREE INTERNATIONAL, INC., a Delaware corporation By: /s/ Nicholas Schacht Name: Nicholas Schacht Title: CEO Hereunto Duly Authorized Date Signed: 12/24/09 -4-", "section_full_title": "4.CONDITION OF LANDLORDS EXECUTION", "document_id": "180qW5LiKhjqbih6MaWJp1.", "section_title": "CONDITION OF LANDLORDS EXECUTION"}, {"text": " (a)ADR (b) ADRs mean the American Depositary Receipts executed and delivered hereunder ADRs may be either in physical certificated form or Direct Registration ADRs. ADRs in physical certificated form, and the terms and conditions governing the Direct Registration ADRs (as hereinafter defined), shall be substantially in the form of Exhibit A annexed hereto (the form of ADR). The term Direct Registration ADR means an ADR, the ownership of which is recorded on the Direct Registration System. References to ADRs shall include certificated ADRs and Direct Registration ADRs, unless the context otherwise requires. The form of ADR is hereby incorporated herein and made a part hereof; the provisions of the form of ADR shall be binding upon the parties hereto. (c) Subject to paragraph (13) of the form of ADR, each ADS evidenced by an ADR represents the right to receive six Shares and a pro rata share in any other Deposited Securities (d) Custodian means the agent or agents of the Depositary (singly or collectively, as the context requires) and any additional or substitute Custodian appointed pursuant to Section 9. (e) The terms deliver, execute, issue, register, surrender, transfer or cancel, when used with respect to Direct Registration ADRs, shall refer to an entry or entries or an electronic transfer or transfers in the Direct Registration System, and, when used with respect to ADRs in physical certificated form, shall refer to the physical delivery, execution, issuance, registration, surrender, transfer or cancellation of certificates representing the ADRs (f) Delivery Order is defined in Section 3. (g) Deposited Securities as of any time means all Shares at such time deposited under this Deposit Agreement and any and all 1 other Shares, securities, property and cash at such time held by the Depositary or the Custodian in respect or in lieu of such deposited Shares and other Shares, securities, property and cash. (h) Direct Registration System means the system for the uncertificated registration of ownership of securities established by The Depository Trust Company (DTC) and utilized by the Depositary pursuant to which the Depositary may record the ownership of ADRs without the issuance of a certificate, which ownership shall be evidenced by periodic statements issued by the Depositary to the Holders entitled thereto For purposes hereof, the Direct Registration System shall include access to the Profile Modification System maintained by DTC which provides for automated transfer of ownership between DTC and the Depositary. (i) Holder means the person or persons in whose name an ADR is registered on the ADR Register (j) Securities Act of 1933 means the United States Securities Act of 1933, as from time to time amended. (k) Securities Exchange Act of 1934 means the United States Securities Exchange Act of 1934, as from time to time amended (l) Shares mean the ordinary shares of the Company, and shall include the rights to receive Shares specified in paragraph (1) of the form of ADR. (m) Transfer Office is defined in paragraph (3) of the form of ADR (n) Withdrawal Order is defined in Section 6.", "section_full_title": "1. Certain Definitions", "document_id": "18aRQiXDkL1flaLLgbmeE8.", "section_title": " Certain Definitions"}, {"text": " (a) ADRs in certificated form shall be engraved, printed or otherwise reproduced at the discretion of the Depositary in accordance with its customary practices in its American depositary receipt business, or at the request of the Company typewritten and photocopied on plain or safety paper, and shall be substantially in the form set forth in the form of ADR, with such changes as may be required by the Depositary or the Company to comply with their obligations hereunder, any applicable law, regulation or usage or to indicate any special limitations or restrictions to which any particular ADRs are subject. ADRs may be issued in denominations of any number of ADSs. ADRs in certificated form shall be executed by the Depositary by the manual or facsimile signature of a duly authorized officer of the Depositary. ADRs in certificated form bearing the facsimile signature of anyone who was at the time of execution a duly authorized officer of the Depositary shall bind the Depositary, notwithstanding that such officer has ceased to hold such office prior to the delivery of such ADRs. 2 (b) Direct Registration ADRs. Notwithstanding anything in this Deposit Agreement or in the form of ADR to the contrary, ADSs shall be evidenced by Direct Registration ADRs, unless certificated ADRs are specifically requested by the Holder. (c) Holders shall be bound by the terms and conditions of this Deposit Agreement and of the form of ADR, regardless of whether their ADRs are Direct Registration ADRs or certificated ADRs.", "section_full_title": "2. ADRs", "document_id": "18aRQiXDkL1flaLLgbmeE8.", "section_title": " ADRs"}, {"text": " In connection with the deposit of Shares hereunder, the Depositary or the Custodian may require the following in form satisfactory to it: (a) a written order directing the Depositary to issue to, or upon the written order of, the person or persons designated in such order a Direct Registration ADR or ADRs evidencing the number of ADSs representing such deposited Shares (a Delivery Order); (b) proper endorsements or duly executed instruments of transfer in respect of such deposited Shares; (c) instruments assigning to the Depositary, the Custodian or a nominee of either any distribution on or in respect of such deposited Shares or indemnity therefor; and (d) proxies entitling the Custodian to vote such deposited Shares. As soon as practicable after the Custodian receives Deposited Securities pursuant to any such deposit or pursuant to paragraph (10) or (13) of the form of ADR, the Custodian shall present such Deposited Securities for registration of transfer into the name of the Depositary, the Custodian or a nominee of either, to the extent such registration is practicable, at the cost and expense of the person making such deposit (or for whose benefit such deposit is made) and shall obtain evidence satisfactory to it of such registration. Deposited Securities shall be held by the Custodian for the account and to the order of the Depositary at such place or places and in such manner as the Depositary shall determine. Deposited Securities may be delivered by the Custodian to any person only under the circumstances expressly contemplated in this Deposit Agreement. To the extent that the provisions of or governing the Shares make delivery of certificates therefor impracticable, Shares may be deposited hereunder by such delivery thereof as the Depositary or the Custodian may reasonably accept, including, without limitation, by causing them to be credited to an account maintained by the Custodian for such purpose with the Company or an accredited intermediary, such as a bank, acting as a registrar for the Shares, together with delivery of the documents, payments and Delivery Order referred to herein to the Custodian or the Depositary.", "section_full_title": "3. Deposit of Shares", "document_id": "18aRQiXDkL1flaLLgbmeE8.", "section_title": " Deposit of Shares"}, {"text": " After any such deposit of Shares, the Custodian shall notify the Depositary of such deposit and of the information contained in any related Delivery Order by letter, first class airmail postage prepaid, or, at the request, risk and expense of the person making the deposit, by cable, telex or facsimile transmission. After receiving such notice from the Custodian, the Depositary, subject to this Deposit Agreement, shall properly issue at the Transfer Office, to or upon the order of any person named in such notice, an ADR or ADRs registered as requested and evidencing the aggregate ADSs to which such person is entitled. 3", "section_full_title": "4. Issue of ADRs", "document_id": "18aRQiXDkL1flaLLgbmeE8.", "section_title": " Issue of ADRs"}, {"text": " To the extent that the Depositary determines in its reasonable discretion that any distribution pursuant to paragraph (10) of the form of ADR is not practicable with respect to any Holder, the Depositary may make such distribution as it so deems practicable, including the distribution of foreign currency, securities or property (or appropriate documents evidencing the right to receive foreign currency, securities or property) or the retention thereof as Deposited Securities with respect to such Holder's ADRs (without liability for interest thereon or the investment thereof).", "section_full_title": "5. Distributions on Deposited Securities", "document_id": "18aRQiXDkL1flaLLgbmeE8.", "section_title": " Distributions on Deposited Securities"}, {"text": " In connection with any surrender of an ADR for withdrawal of the Deposited Securities represented by the ADSs evidenced thereby, the Depositary may require proper endorsement in blank of such ADR (or duly executed instruments of transfer thereof in blank) and the Holder's written order directing the Depositary to cause the Deposited Securities represented by the ADSs evidenced by such ADR to be withdrawn and delivered to, or upon the written order of, any person designated in such order (a Withdrawal Order). Directions from the Depositary to the Custodian to deliver Deposited Securities shall be given by letter, first class airmail postage prepaid, or, at the request, risk and expense of the Holder, by cable, telex or facsimile transmission. Delivery of Deposited Securities may be made by the delivery of certificates (which, if required by law shall be properly endorsed or accompanied by properly executed instruments of transfer or, if such certificates may be registered, registered in the name of such Holder or as ordered by such Holder in any Withdrawal Order) or by such other means as the Depositary may deem practicable, including, without limitation, by transfer of record ownership thereof to an account designated in the Withdrawal Order maintained either by the Company or an accredited intermediary, such as a bank, acting as a registrar for the Deposited Securities.", "section_full_title": "6. Withdrawal of Deposited Securities", "document_id": "18aRQiXDkL1flaLLgbmeE8.", "section_title": " Withdrawal of Deposited Securities"}, {"text": " The Depositary shall execute and deliver a new Direct Registration ADR in exchange and substitution for any mutilated certificated ADR upon cancellation thereof or in lieu of and in substitution for such destroyed, lost or stolen certificated ADR, unless the Depositary has notice that such ADR has been acquired by a bona fide purchaser, upon the Holder thereof filing with the Depositary a request for such execution and delivery and a sufficient indemnity bond and satisfying any other reasonable requirements imposed by the Depositary.", "section_full_title": "7. Substitution of ADRs", "document_id": "18aRQiXDkL1flaLLgbmeE8.", "section_title": " Substitution of ADRs"}, {"text": " All ADRs surrendered to the Depositary shall be cancelled by the Depositary. The Depositary is authorized to destroy ADRs in certificated form so cancelled in accordance with its customary practices. The Depositary agrees to maintain or cause its agents to maintain records of all ADRs surrendered and Deposited Securities withdrawn under Section 6 hereof and paragraph (2) of the form of ADR, substitute ADRs delivered under Section 7 hereof, and canceled or destroyed ADRs under this Section 8, in keeping with the procedures ordinarily followed by stock transfer agents located in the City of New York or as required by the laws or regulations governing the Depositary. 4", "section_full_title": "8. Cancellation and Destruction of ADRs; Maintenance of Records", "document_id": "18aRQiXDkL1flaLLgbmeE8.", "section_title": " Cancellation and Destruction of ADRs; Maintenance of Records"}, {"text": " Any Custodian in acting hereunder shall be subject to the directions of the Depositary and shall be responsible solely to it. The Depositary shall be responsible for the compliance by the Custodian with any applicable provisions of the Deposit Agreement. The Depositary reserves the right to add, replace or remove a Custodian. The Depositary will give prompt notice of any such action, which will be advance notice if practicable. Each Custodian so appointed (other than JPMorgan Chase Bank, N.A.) shall give written notice to the Company and the Depositary accepting such appointment and agreeing to be bound by the applicable terms hereof. Any Custodian may resign from its duties hereunder by at least 30 days written notice to the Depositary. The Depositary may discharge any Custodian at any time upon notice to the Custodian being discharged. Any Custodian ceasing to act hereunder as Custodian shall deliver, upon the instruction of the Depositary, all Deposited Securities held by it to a Custodian continuing to act. If upon the effectiveness of such resignation there would be no Custodian acting hereunder, the Depositary shall, promptly after receiving such notice, appoint a substitute custodian or custodians, each of which shall thereafter be a Custodian hereunder.", "section_full_title": "9. The Custodian", "document_id": "18aRQiXDkL1flaLLgbmeE8.", "section_title": " The Custodian"}]